Vladimir-Trufanov/ittve-ESP32-CAM/99-Фото ловушка на ESP32 CAM/ESP-Mail-Client-master/src/ESP_Mail_Client.cpp
  int cmem = MailClient.getFreeHeap();

  if (cmem < ESP_MAIL_MIN_MEM)
  {
    if (imap->_debug)
    {
      esp_mail_debug("");
      errorStatusCB(imap, MAIL_CLIENT_ERROR_OUT_OF_MEMORY);
    }
    goto out;
  }

  // new session
  if (!imap->_tcpConnected)
  {
    // authenticate new
    if (!imapAuth(imap))
    {
      closeTCPSession(imap);
      return false;
    }
  }
  else
  {
    // reuse session
    for (size_t i = 0; i < imap->_headers.size(); i++)
      imap->_headers[i].part_headers.clear();
    imap->_headers.clear();

    if (imap->_config->fetch.uid.length() > 0)
      imap->_headerOnly = false;
    else
      imap->_headerOnly = true;
  }

  imap->_rfc822_part_count = 0;
  imap->_mbif._availableItems = 0;
  imap->_msgUID.clear();
  imap->_uidSearch = false;
  imap->_mbif._searchCount = 0;

  if (imap->_currentFolder.length() == 0)
    return handleIMAPError(imap, IMAP_STATUS_NO_MAILBOX_FOLDER_OPENED, false);

  if (!imap->_mailboxOpened || (imap->_config->fetch.set_seen && !imap->_headerOnly && imap->_readOnlyMode))
  {
    if (!imap->openFolder(imap->_currentFolder.c_str(), imap->_readOnlyMode && !imap->_config->fetch.set_seen))
      return handleIMAPError(imap, IMAP_STATUS_OPEN_MAILBOX_FAILED, false);
  }

  if (imap->_headerOnly)
  {
    if (imap->_config->search.criteria.length() > 0)
    {

      if (imap->_readCallback)
      {
        imapCB(imap, "", false);
        imapCBP(imap, esp_mail_str_66, false);
      }

      if (imap->_debug)
        debugInfoP(esp_mail_str_232);

      if (strposP(imap->_config->search.criteria.c_str(), esp_mail_str_137, 0) != -1)
      {
        imap->_uidSearch = true;
        command += esp_mail_str_138;
      }

      command += esp_mail_str_139;

      for (size_t i = 0; i < imap->_config->search.criteria.length(); i++)
      {
        if (imap->_config->search.criteria[i] != ' ' && imap->_config->search.criteria[i] != '\r' && imap->_config->search.criteria[i] != '\n' && imap->_config->search.criteria[i] != '$')
          buf.append(1, imap->_config->search.criteria[i]);

        if (imap->_config->search.criteria[i] == ' ')
        {

          MB_String s1 = esp_mail_str_140;
          MB_String s2 = esp_mail_str_224;
          MB_String s3 = esp_mail_str_141;

          if ((imap->_uidSearch && strcmp(buf.c_str(), s1.c_str()) == 0) || (imap->_unseen && buf.find(s2.c_str()) != MB_String::npos))
            buf.clear();

          if (strcmp(buf.c_str(), s3.c_str()) != 0 && buf.length() > 0)
          {
            command += esp_mail_str_131;
            command += buf;
          }

          buf.clear();
        }
      }

      MB_String s1 = esp_mail_str_223;

      if (imap->_unseen && strpos(imap->_config->search.criteria.c_str(), s1.c_str(), 0) == -1)
        command += esp_mail_str_223;

      if (buf.length() > 0)
      {
        command += esp_mail_str_131;
        command += buf;
      }

      if (imapSend(imap, command.c_str(), true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
        return false;

      command.clear();

      imap->_imap_cmd = esp_mail_imap_command::esp_mail_imap_cmd_search;

      if (!handleIMAPResponse(imap, IMAP_STATUS_BAD_COMMAND, closeSession))
        return false;

      if (imap->_readCallback)
      {
        MB_String s = esp_mail_str_34;
        s += esp_mail_str_68;
        s += imap->_config->limit.search;
        imapCB(imap, s.c_str(), false);

        if (imap->_msgUID.size() > 0)
        {

          s = esp_mail_str_69;
          s += imap->_mbif._searchCount;
          s += esp_mail_str_70;
          imapCB(imap, s.c_str(), false);

          s = esp_mail_str_71;
          s += imap->_msgUID.size();
          s += esp_mail_str_70;
          imapCB(imap, s.c_str(), false);
        }
        else
          imapCBP(imap, esp_mail_str_72, false);
      }
    }
    else
    {
      if (imap->_readCallback)
        imapCBP(imap, esp_mail_str_73, false);

      imap->_mbif._availableItems++;
      uint32_t uid = imap->getUID(imap->_mbif._msgCount);

      imap->_msgUID.push_back(uid);
      imap->_headerOnly = false;
      _uid = uid;
      imap->_config->fetch.uid = _uid;
    }
  }
  else
  {

    if (imap->_config->fetch.uid.length() > 0)
    {
      uint32_t uid = atoi(imap->_config->fetch.uid.c_str());
      imap->_mbif._availableItems++;
      imap->_msgUID.push_back(uid);
    }
  }

  for (size_t i = 0; i < imap->_msgUID.size(); i++)
  {
    imap->_cMsgIdx = i;
    imap->_totalRead++;

    if (MailClient.getFreeHeap() - (imap->_config->limit.msg_size * (i + 1)) < ESP_MAIL_MIN_MEM)
    {
      if (imap->_debug)
        errorStatusCB(imap, MAIL_CLIENT_ERROR_OUT_OF_MEMORY);
      goto out;
    }

    if (imap->_readCallback)
    {
      readCount++;

      MB_String s = esp_mail_str_74;
      s += imap->_totalRead;

      if (imap->_uidSearch || imap->_config->fetch.uid.length() > 0)
        s += esp_mail_str_75;
      else
        s += esp_mail_str_76;

      s += imap->_msgUID[i];
      imapCB(imap, "", false);
      imapCB(imap, s.c_str(), false);
    }

    if (imap->_debug)
      debugInfoP(esp_mail_str_233);

    MB_String cmd;
    if (imap->_uidSearch || imap->_config->fetch.uid.length() > 0)
      cmd += esp_mail_str_142;
    else
      cmd += esp_mail_str_143;

    if (imap->_debug)
      debugInfoP(esp_mail_str_77);

    cmd += imap->_msgUID[i];

    cmd += esp_mail_str_147;
    if (!imap->_config->fetch.set_seen)
    {
      cmd += esp_mail_str_152;
      cmd += esp_mail_str_214;
    }
    cmd += esp_mail_str_218;

    cmd += esp_mail_str_144;
    cmd += esp_mail_str_219;
    if (imapSend(imap, cmd.c_str(), true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return false;

    imap->_imap_cmd = esp_mail_imap_command::esp_mail_imap_cmd_fetch_body_header;

    int err = IMAP_STATUS_BAD_COMMAND;
    if (imap->_headerOnly)
      err = IMAP_STATUS_IMAP_RESPONSE_FAILED;

    if (!handleIMAPResponse(imap, err, closeSession))
      return false;

    cHeader(imap)->flags = imap->getFlags(cHeader(imap)->message_no);

    if (!imap->_headerOnly)
    {
      imap->_cPartIdx = 0;

