Vladimir-Trufanov/ittve-ESP32-CAM/99-Фото ловушка на ESP32 CAM/ESP-Mail-Client-master/src/ESP_Mail_Client.cpp
        if (header.multipart)
        {
          if (strcmpP(buf, 0, esp_mail_str_277))
          {
            tmp = subStr(buf, esp_mail_str_277, esp_mail_str_136, 0, 0, false);
            if (tmp)
            {
              headerState = esp_mail_imap_header_state::esp_mail_imap_state_boundary;
              setHeader(imap, tmp, header, headerState);
              delP(&tmp);
            }
          }
        }
      }

      delP(&buf);

      decodeHeader(header.header_fields.messageID);
      decodeHeader(header.header_fields.from);
      decodeHeader(header.header_fields.sender);
      decodeHeader(header.header_fields.to);
      decodeHeader(header.header_fields.cc);
      decodeHeader(header.header_fields.bcc);
      decodeHeader(header.header_fields.subject);
      decodeHeader(header.header_fields.date);
      decodeHeader(header.header_fields.return_path);
      decodeHeader(header.header_fields.reply_to);
      decodeHeader(header.header_fields.in_reply_to);
      decodeHeader(header.header_fields.references);
      decodeHeader(header.header_fields.comments);
      decodeHeader(header.header_fields.keywords);
      imap->_headers.push_back(header);
    }

    if (imap->_imap_cmd == esp_mail_imap_cmd_fetch_body_mime)
    {
      // expect the octet length in the response for the existent part
      if (part.octetLen > 0)
      {

        part.partNumStr = cHeader(imap)->partNumStr;
        part.partNumFetchStr = cHeader(imap)->partNumStr;
        if (cHeader(imap)->part_headers.size() > 0)
        {

          struct esp_mail_message_part_info_t *_part = &cHeader(imap)->part_headers[cHeader(imap)->part_headers.size() - 1];
          bool rfc822_body_subtype = _part->message_sub_type == esp_mail_imap_message_sub_type_rfc822;

          if (rfc822_body_subtype)
          {
            if (!_part->rfc822_part)
            {
              // additional rfc822 message header, store it to the rfc822 part header
              _part->rfc822_part = true;
              _part->rfc822_header = part.rfc822_header;
              imap->_rfc822_part_count++;
              _part->rfc822_msg_Idx = imap->_rfc822_part_count;
            }
          }
        }

        cHeader(imap)->part_headers.push_back(part);
        cHeader(imap)->message_data_count = cHeader(imap)->part_headers.size();

        if (part.msg_type == esp_mail_msg_type_plain || part.msg_type == esp_mail_msg_type_enriched || part.msg_type == esp_mail_msg_type_html || part.attach_type == esp_mail_att_type_none || (part.attach_type == esp_mail_att_type_attachment && imap->_config->download.attachment) || (part.attach_type == esp_mail_att_type_inline && imap->_config->download.inlineImg))
        {
          if (part.message_sub_type != esp_mail_imap_message_sub_type_rfc822)
          {
            if (part.attach_type != esp_mail_att_type_none && cHeader(imap)->multipart_sub_type != esp_mail_imap_multipart_sub_type_alternative)
              cHeader(imap)->attachment_count++;
          }
        }
      }
      else
      {
        // nonexistent part
        // return false to exit the loop without closing the connection
        if (closeSession)
          imap->closeSession();
        return false;
      }
    }

    if (imap->_imap_cmd == esp_mail_imap_cmd_fetch_body_attachment || imap->_imap_cmd == esp_mail_imap_cmd_fetch_body_text || imap->_imap_cmd == esp_mail_imap_cmd_fetch_body_inline)
    {
      if (cPart(imap)->file_open_write)
        mbfs->close(mbfs_type imap->_config->storage.type);
    }

    if (imap->_imap_cmd == esp_mail_imap_cmd_fetch_body_text)
      cPart(imap)->text[cPart(imap)->textLen] = 0;
  }
  else
  {
    // some server responses NO and should exit (false) from MIME feching loop without
    // closing the session
    if (imap->_imap_cmd != esp_mail_imap_cmd_fetch_body_mime)
      return handleIMAPError(imap, errCode, false);

    if (closeSession)
      imap->closeSession();
    return false;
  }

  return true;
}

void ESP_Mail_Client::addHeader(MB_String &s, const char *name, const MB_String &value, bool trim, bool json)
{
  if (json)
  {
    s += (s.length() > 0) ? MBSTRING_FLASH_MCR(",\"") : MBSTRING_FLASH_MCR("{\"");
    s += name;
    s += MBSTRING_FLASH_MCR("\":\"");
    if (trim)
    {
      MB_String t = value;
      t.replaceAll("\"", "");
      s += t;
    }
    else
      s += value;
    s += MBSTRING_FLASH_MCR("\"");
  }
  else
  {
    if (s.length() > 0)
      s += MBSTRING_FLASH_MCR("\r\n");
    s += name;
    s += MBSTRING_FLASH_MCR(": ");
    s += value;
  }
}

void ESP_Mail_Client::addHeader(MB_String &s, const char *name, int value, bool json)
{
  if (json)
  {
    s += (s.length() > 0) ? MBSTRING_FLASH_MCR(",\"") : MBSTRING_FLASH_MCR("{\"");
    s += name;
    s += MBSTRING_FLASH_MCR("\":");
    s += value;
  }
  else
  {
    if (s.length() > 0)
      s += MBSTRING_FLASH_MCR("\r\n");
    s += name;
    s += MBSTRING_FLASH_MCR(": ");
    s += value;
  }
}

void ESP_Mail_Client::saveHeader(IMAPSession *imap, bool json)
{

  MB_String headerFilePath;

  prepareFilePath(imap, headerFilePath, true);

  if (json)
    headerFilePath += esp_mail_str_347;
  else
    headerFilePath += esp_mail_str_203;

  prepareFileList(imap, headerFilePath);

  int sz = mbfs->open(headerFilePath, mbfs_type imap->_config->storage.type, mb_fs_open_mode_write);
  if (sz < 0)
  {
    if (imap->_debug)
    {
      imap->_imapStatus.statusCode = sz;
      imap->_imapStatus.text.clear();

      MB_String e = esp_mail_str_185;
      e += imap->errorReason().c_str();
      esp_mail_debug_line(e.c_str(), true);
    }
    return;
  }

  MB_String s;

  for (size_t i = 0; i < imap->_headers.size(); i++)
    addHeaderItem(s, &imap->_headers[i], json);

  if (json)
    s += MBSTRING_FLASH_MCR("]}");

  mbfs->print(mbfs_type imap->_config->storage.type, s.c_str());

  mbfs->close(mbfs_type imap->_config->storage.type);

  imap->_headerSaved = true;
}

void ESP_Mail_Client::addHeaderItem(MB_String &str, esp_mail_message_header_t *header, bool json)
{
  MB_String s;

