Vladimir-Trufanov/ittve-ESP32-CAM/99-Фото ловушка на ESP32 CAM/ESP-Mail-Client-master/src/ESP_Mail_Client.cpp
  if (json)
  {
    if (str.length() > 0)
      str += MBSTRING_FLASH_MCR(",");
    else
      str = MBSTRING_FLASH_MCR("{\"Messages\":[");
  }

  addHeader(s, "Number", header->message_no, json);
  addHeader(s, "UID", header->message_uid, json);

  if (header->accept_language.length() > 0)
    addHeader(s, "Accept-Language", header->accept_language, false, json);

  if (header->content_language.length() > 0)
    addHeader(s, "Content-Language", header->content_language, false, json);

  addHeaders(s, &header->header_fields, json);

  for (size_t j = 0; j < header->part_headers.size(); j++)
  {
    if (header->part_headers[j].rfc822_part)
    {
      MB_String s1;
      addHeaders(s1, &header->part_headers[j].rfc822_header, json);

      if (json)
      {
        s += MBSTRING_FLASH_MCR(",\"RFC822\":");
        s += s1;
        s += MBSTRING_FLASH_MCR("}");
      }
      else
      {
        s += MBSTRING_FLASH_MCR("\r\n\r\nRFC822:\r\n");
        s += s1;
      }
    }
  }

  if (header->attachment_count > 0)
  {
    if (json)
    {
      s += MBSTRING_FLASH_MCR(",\"Attachments\":{\"Count\":");
      s += header->attachment_count;
      s += MBSTRING_FLASH_MCR(",\"Files\":[");
    }
    else
    {
      s += MBSTRING_FLASH_MCR("\r\n\r\nAttachments (");
      s += header->attachment_count;
      s += MBSTRING_FLASH_MCR(")\r\n");
    }

    int index = 0;
    for (size_t j = 0; j < header->part_headers.size(); j++)
    {

      if (header->part_headers[j].attach_type == esp_mail_att_type_none || header->part_headers[j].rfc822_part)
        continue;

      struct esp_mail_attachment_info_t att;
      att.filename = header->part_headers[j].filename.c_str();
      att.mime = header->part_headers[j].content_type.c_str();
      att.name = header->part_headers[j].name.c_str();
      att.size = header->part_headers[j].attach_data_size;
      att.creationDate = header->part_headers[j].creation_date.c_str();
      att.type = header->part_headers[j].attach_type;

      if (json)
      {
        if (index > 0)
          s += MBSTRING_FLASH_MCR(",");
        s += MBSTRING_FLASH_MCR("{\"Filename\":\"");
        s += att.filename;
        s += MBSTRING_FLASH_MCR("\"");
      }
      else
      {
        if (index > 0)
          s += MBSTRING_FLASH_MCR("\r\n");
        s += MBSTRING_FLASH_MCR("\r\n");
        s += MBSTRING_FLASH_MCR("Index: ");
        s += index + 1;
        addHeader(s, "Filename", att.filename, false, json);
      }

      addHeader(s, "Name", att.name, false, json);
      addHeader(s, "Size", att.size, false, json);
      addHeader(s, "MIME", att.mime, false, json);
      addHeader(s, "Type", att.type == esp_mail_att_type_attachment ? "attachment" : "inline", false, json);
      addHeader(s, "Creation Date", att.creationDate, false, json);

      if (json)
        s += MBSTRING_FLASH_MCR("}");

      index++;
    }

    if (json)
      s += MBSTRING_FLASH_MCR("]}");
  }

  if (json)
  {
    s += MBSTRING_FLASH_MCR("}");
  }

  str += s;
}

void ESP_Mail_Client::addHeaders(MB_String &s, esp_mail_imap_rfc822_msg_header_item_t *header, bool json)
{

  if (header->messageID.length() > 0)
    addHeader(s, "Message-ID", header->messageID, false, json);

  if (header->from.length() > 0)
    addHeader(s, "From", header->from, true, json);

  if (header->sender.length() > 0)
    addHeader(s, "Sender", header->sender, true, json);

  if (header->to.length() > 0)
    addHeader(s, "To", header->to, true, json);

  if (header->cc.length() > 0)
    addHeader(s, "CC", header->cc, true, json);

  if (header->date.length() > 0)
    addHeader(s, "Date", header->date, false, json);

  if (header->subject.length() > 0)
    addHeader(s, "Subject", header->subject, false, json);

  if (header->reply_to.length() > 0)
    addHeader(s, "Reply-To", header->reply_to, true, json);

  if (header->return_path.length() > 0)
    addHeader(s, "Return-Path", header->return_path, true, json);

  if (header->in_reply_to.length() > 0)
    addHeader(s, "In-Reply-To", header->in_reply_to, true, json);

  if (header->references.length() > 0)
    addHeader(s, "References", header->references, true, json);

  if (header->comments.length() > 0)
    addHeader(s, "Comments", header->comments, false, json);

  if (header->keywords.length() > 0)
    addHeader(s, "Keywords", header->keywords, false, json);
}

esp_mail_imap_response_status ESP_Mail_Client::imapResponseStatus(IMAPSession *imap, char *response)
{
  imap->_imapStatus.text.clear();
  if (strposP(response, esp_mail_imap_response_1, 0) > -1)
    return esp_mail_imap_response_status::esp_mail_imap_resp_ok;
  else if (strposP(response, esp_mail_imap_response_2, 0) > -1)
  {
    imap->_imapStatus.text = response;
    imap->_imapStatus.text = imap->_imapStatus.text.substr(strlen_P(esp_mail_imap_response_2));
    return esp_mail_imap_response_status::esp_mail_imap_resp_no;
  }
  else if (strposP(response, esp_mail_imap_response_3, 0) > -1)
  {
    imap->_imapStatus.text = response;
    imap->_imapStatus.text = imap->_imapStatus.text.substr(strlen_P(esp_mail_imap_response_3));
    return esp_mail_imap_response_status::esp_mail_imap_resp_bad;
  }
  return esp_mail_imap_response_status::esp_mail_imap_resp_unknown;
}

void ESP_Mail_Client::handleCapability(IMAPSession *imap, char *buf, int &chunkIdx)
{
  if (chunkIdx == 0)
  {
    if (strposP(buf, esp_mail_imap_response_10, 0) > -1)
    {
      if (strposP(buf, esp_mail_imap_response_11, 0) > -1)
        imap->_auth_capability.login = true;
      if (strposP(buf, esp_mail_imap_response_12, 0) > -1)
        imap->_auth_capability.plain = true;
      if (strposP(buf, esp_mail_imap_response_13, 0) > -1)
        imap->_auth_capability.xoauth2 = true;
      if (strposP(buf, esp_mail_imap_response_14, 0) > -1)
        imap->_auth_capability.start_tls = true;
      if (strposP(buf, esp_mail_imap_response_15, 0) > -1)
        imap->_auth_capability.cram_md5 = true;
      if (strposP(buf, esp_mail_imap_response_16, 0) > -1)
        imap->_auth_capability.digest_md5 = true;
      if (strposP(buf, esp_mail_imap_response_17, 0) > -1)
        imap->_read_capability.idle = true;
      if (strposP(buf, esp_mail_imap_response_18, 0) > -1)
        imap->_read_capability.imap4 = true;
      if (strposP(buf, esp_mail_imap_response_19, 0) > -1)
        imap->_read_capability.imap4rev1 = true;
    }
  }
}

void ESP_Mail_Client::handleFolders(IMAPSession *imap, char *buf)
{
  struct esp_mail_folder_info_t fd;
  char *tmp = nullptr;
  int p1 = strposP(buf, esp_mail_imap_response_4, 0);
  int p2 = 0;
  if (p1 != -1)
  {
    p1 = strposP(buf, esp_mail_str_198, 0);
    if (p1 != -1)
    {
      p2 = strposP(buf, esp_mail_str_192, p1 + 1);
      if (p2 != -1)
      {
        tmp = (char *)newP(p2 - p1);
        strncpy(tmp, buf + p1 + 1, p2 - p1 - 1);
        if (tmp[p2 - p1 - 2] == '\r')
          tmp[p2 - p1 - 2] = 0;
        fd.attributes = tmp;
        delP(&tmp);
      }
    }

    p1 = strposP(buf, esp_mail_str_136, 0);
    if (p1 != -1)
    {
      p2 = strposP(buf, esp_mail_str_136, p1 + 1);
      if (p2 != -1)
      {
        tmp = (char *)newP(p2 - p1);
        strncpy(tmp, buf + p1 + 1, p2 - p1 - 1);
        if (tmp[p2 - p1 - 2] == '\r')
          tmp[p2 - p1 - 2] = 0;
        fd.delimiter = tmp;
        delP(&tmp);
      }
    }

    p1 = strposP(buf, esp_mail_str_131, p2);
    if (p1 != -1)
    {
      p2 = strlen(buf);
      tmp = (char *)newP(p2 - p1);
      if (buf[p1 + 1] == '"')
        p1++;
      strncpy(tmp, buf + p1 + 1, p2 - p1 - 1);
      if (tmp[p2 - p1 - 2] == '\r')
        tmp[p2 - p1 - 2] = 0;
      if (tmp[strlen(tmp) - 1] == '"')
        tmp[strlen(tmp) - 1] = 0;
      fd.name = tmp;
      delP(&tmp);
    }
    imap->_folders.add(fd);
  }
}

bool ESP_Mail_Client::handleIdle(IMAPSession *imap)
{

