Vladimir-Trufanov/ittve-ESP32-CAM/99-Фото ловушка на ESP32 CAM/ESP-Mail-Client-master/src/ESP_Mail_Client.cpp
  imap->_cbData.empty();

  return ret;
}

void ESP_Mail_Client::prepareFileList(IMAPSession *imap, MB_String &filePath)
{
#if defined(MBFS_SD_FS)
  if (!mbfs->longNameSupported())
  {
    cHeader(imap)->sd_alias_file_count++;
    MB_String alias = cMSG(imap);
    alias += MBSTRING_FLASH_MCR("_");
    alias += cHeader(imap)->sd_alias_file_count;

    if (imap->_sdFileList.length() > 0)
    {
      if (imap->_sdFileList[imap->_sdFileList.length() - 1] == ']')
      {
        imap->_sdFileList[imap->_sdFileList.length() - 1] = 0;
        imap->_sdFileList += MBSTRING_FLASH_MCR(",");
      }
    }
    imap->_sdFileList += MBSTRING_FLASH_MCR("{\"Renamed\":\"");
    imap->_sdFileList += alias;
    imap->_sdFileList += MBSTRING_FLASH_MCR("\",\"Original\":\"");
    imap->_sdFileList += filePath;
    imap->_sdFileList += MBSTRING_FLASH_MCR("\"}]");
    // rename the original file
    filePath = alias;
  }
#endif
}

bool ESP_Mail_Client::handleAttachment(IMAPSession *imap, char *buf, int bufLen, int &chunkIdx, MB_String &filePath, bool &downloadRequest, int &octetCount, int &octetLength)
{
  if (chunkIdx == 0)
  {
    char *tmp = subStr(buf, esp_mail_str_193, esp_mail_str_194, 0);
    if (tmp)
    {
      octetCount = 0; // CRLF counted from first line
      octetLength = atoi(tmp);
      delP(&tmp);
      chunkIdx++;
      cPart(imap)->octetCount = 0;
      cHeader(imap)->total_download_size += octetLength;
      imap->_lastProgress = -1;

      if (!cPart(imap)->file_open_write)
      {

        if (mbfs->checkStorageReady(mbfs_type imap->_config->storage.type))
        {

          downloadRequest = true;

          filePath.clear();

          filePath += imap->_config->storage.saved_path;
          filePath += esp_mail_str_202;
          filePath += cMSG(imap);

#if defined(MBFS_SD_FS)

          if (imap->_config->storage.type == esp_mail_file_storage_type_sd)
            mbfs->createDirs(filePath);

#endif

          filePath += esp_mail_str_202;

          filePath += cPart(imap)->filename;

          prepareFileList(imap, filePath);

          int sz = mbfs->open(filePath, mbfs_type imap->_config->storage.type, mb_fs_open_mode_write);

          if (sz < 0)
          {
            if (imap->_debug)
            {
              imap->_imapStatus.statusCode = sz;
              imap->_imapStatus.text.clear();

              MB_String e = esp_mail_str_185;
              e += imap->errorReason().c_str();
              esp_mail_debug_line(e.c_str(), true);
            }
          }

          cPart(imap)->file_open_write = true;
        }
        else
          sendStorageNotReadyError(imap, imap->_config->storage.type);
      }
    }
    return true;
  }

  if (octetLength == 0)
    return true;

  chunkIdx++;

  delay(0);

  if (cPart(imap)->octetCount <= octetLength)
  {
    if (cPart(imap)->octetCount + bufLen > octetLength)
    {
      bufLen = octetLength - cPart(imap)->octetCount;
      buf[bufLen] = 0;
      cPart(imap)->octetCount += bufLen;
    }
    else
      cPart(imap)->octetCount = octetCount;

    if (imap->_config->enable.download_status)
    {
      if (imap->_readCallback)
        downloadReport(imap, 100 * cPart(imap)->octetCount / octetLength);
    }

    if (cPart(imap)->xencoding == esp_mail_msg_part_xencoding_base64)
    {

      size_t olen = 0;
      unsigned char *decoded = decodeBase64((const unsigned char *)buf, bufLen, &olen);

      if (decoded)
      {

        if (!cPart(imap)->sizeProp)
        {
          cPart(imap)->attach_data_size += olen;
          cHeader(imap)->total_attach_data_size += cPart(imap)->attach_data_size;
        }
        int write = olen;
        if (mbfs->ready(mbfs_type imap->_config->storage.type))
          write = mbfs->write(mbfs_type imap->_config->storage.type, (uint8_t *)decoded, olen);
        delay(0);
        delP(&decoded);

        if (write != (int)olen)
          return false;
      }

      if (!reconnect(imap))
        return false;
    }
    else
    {
      // binary content
      if (!cPart(imap)->sizeProp)
      {
        cPart(imap)->attach_data_size += bufLen;
        cHeader(imap)->total_attach_data_size += cPart(imap)->attach_data_size;
      }

      int write = bufLen;
      if (mbfs->ready(mbfs_type imap->_config->storage.type))
        write = mbfs->write(mbfs_type imap->_config->storage.type, (uint8_t *)buf, bufLen);

      delay(0);

      if (write != bufLen)
        return false;

      if (!reconnect(imap))
        return false;
    }
  }
  return true;
}

void ESP_Mail_Client::downloadReport(IMAPSession *imap, int progress)
{
  if (progress > 100)
    progress = 100;
  if (imap->_readCallback && imap->_lastProgress != progress && (progress == 0 || progress == 100 || imap->_lastProgress + ESP_MAIL_PROGRESS_REPORT_STEP <= progress))
  {
    MB_String filePath = imap->_config->storage.saved_path;
    filePath += esp_mail_str_202;
    filePath += cMSG(imap);
    filePath += esp_mail_str_202;
    filePath += cPart(imap)->filename;

    MB_String s = esp_mail_str_90;
    s += esp_mail_str_131;
    s += MBSTRING_FLASH_MCR("\"");
    s += filePath;
    s += MBSTRING_FLASH_MCR("\"");
    s += esp_mail_str_91;
    s += progress;
    s += esp_mail_str_92;
    s += esp_mail_str_34;
    esp_mail_debug_line(s.c_str(), false);
    s.clear();
    imap->_lastProgress = progress;
  }
}

void ESP_Mail_Client::fetchReport(IMAPSession *imap, int progress, bool download)
{
  if (progress > 100)
    progress = 100;
  if (imap->_readCallback && imap->_lastProgress != progress && (progress == 0 || progress == 100 || imap->_lastProgress + ESP_MAIL_PROGRESS_REPORT_STEP <= progress))
  {
    MB_String s;

    if (download)
      s = esp_mail_str_90;
    else
      s = esp_mail_str_83;
    s += esp_mail_str_131;
    if (cPart(imap)->filename.length() > 0)
    {
      s += MBSTRING_FLASH_MCR("\"");
      s += cPart(imap)->filename;
      s += MBSTRING_FLASH_MCR("\"");
      s += esp_mail_str_91;
    }
    s += progress;
    s += esp_mail_str_92;
    s += esp_mail_str_34;
    esp_mail_debug_line(s.c_str(), false);
    s.clear();
    imap->_lastProgress = progress;
  }
}

void ESP_Mail_Client::searchReport(int progress, const char *percent)
{
  if (progress % ESP_MAIL_PROGRESS_REPORT_STEP == 0)
  {
    MB_String s = esp_mail_str_261;
    s += progress;
    s += percent;
    s += esp_mail_str_34;
    esp_mail_debug_line(s.c_str(), false);
  }
}

int ESP_Mail_Client::cMSG(IMAPSession *imap)
{
  return imap->_msgUID[cIdx(imap)];
}

