Vladimir-Trufanov/ittve-ESP32-CAM/99-Фото ловушка на ESP32 CAM/ESP-Mail-Client-master/src/ESP_Mail_Client.cpp
int ESP_Mail_Client::cIdx(IMAPSession *imap)
{
  return imap->_cMsgIdx;
}

void ESP_Mail_Client::decodeText(IMAPSession *imap, char *buf, int bufLen, int &chunkIdx, MB_String &filePath, bool &downloadRequest, int &octetLength, int &octetCount)
{

  bool rfc822_body_subtype = cPart(imap)->message_sub_type == esp_mail_imap_message_sub_type_rfc822;
  if (chunkIdx == 0)
  {
    imap->_lastProgress = -1;
    char *tmp = subStr(buf, esp_mail_str_193, esp_mail_str_194, 0);
    if (tmp)
    {

      octetCount = 0;
      octetLength = atoi(tmp);
      delP(&tmp);
      chunkIdx++;
      cPart(imap)->octetLen = octetLength;
      cPart(imap)->octetCount = 0;

      bool dlMsg = (rfc822_body_subtype && imap->_config->download.rfc822) || (!rfc822_body_subtype && ((cPart(imap)->msg_type == esp_mail_msg_type_html && imap->_config->download.html) || ((cPart(imap)->msg_type == esp_mail_msg_type_plain || cPart(imap)->msg_type == esp_mail_msg_type_enriched) && imap->_config->download.text)));
      if (dlMsg)
        prepareFilePath(imap, filePath, false);

      if (filePath.length() == 0)
      {
        if (!rfc822_body_subtype)
          filePath += esp_mail_str_67;
        else
        {
          filePath += esp_mail_str_82;
          filePath += esp_mail_str_131;
          filePath += esp_mail_str_67;
        }
      }
      cPart(imap)->filename = filePath;

      if (!cPart(imap)->file_open_write && dlMsg)
      {

        prepareFileList(imap, filePath);

        int sz = mbfs->open(filePath, mbfs_type imap->_config->storage.type, mb_fs_open_mode_write);
        if (sz > -1)
        {
          downloadRequest = true;
          cPart(imap)->file_open_write = true;
        }
        else
        {
          imap->_imapStatus.statusCode = sz;
          imap->_imapStatus.text.clear();

          if (imap->_debug)
          {
            MB_String e = esp_mail_str_185;
            e += imap->errorReason().c_str();
            esp_mail_debug_line(e.c_str(), true);
          }
        }
      }

      return;
    }
    else
    {
      if (imap->_debug)
      {
        MB_String s1 = esp_mail_str_280;
        esp_mail_debug_line(s1.c_str(), false);
      }
    }
  }

  delay(0);

  if (octetLength == 0)
    return;

  bool enableDownloads = (imap->_config->download.rfc822 && rfc822_body_subtype) || (!rfc822_body_subtype && ((cPart(imap)->msg_type == esp_mail_msg_type_html && imap->_config->download.html) || ((cPart(imap)->msg_type == esp_mail_msg_type_plain || cPart(imap)->msg_type == esp_mail_msg_type_enriched) && imap->_config->download.text)));

  if (imap->_config->download.rfc822 || imap->_config->download.html || imap->_config->download.text || (rfc822_body_subtype && imap->_config->enable.rfc822) || (!rfc822_body_subtype && ((cPart(imap)->msg_type == esp_mail_msg_type_html && imap->_config->enable.html) || ((cPart(imap)->msg_type == esp_mail_msg_type_plain || cPart(imap)->msg_type == esp_mail_msg_type_enriched) && imap->_config->enable.text))))
  {

    if (cPart(imap)->octetCount + bufLen > octetLength)
    {
      bufLen = octetLength - cPart(imap)->octetCount;
      buf[bufLen] = 0;
      cPart(imap)->octetCount += bufLen;
    }
    else
      cPart(imap)->octetCount = octetCount;

    if (imap->_readCallback)
      fetchReport(imap, 100 * cPart(imap)->octetCount / octetLength, enableDownloads);

    if (cPart(imap)->octetCount <= octetLength)
    {
      bool hrdBrk = cPart(imap)->xencoding != esp_mail_msg_part_xencoding_base64 && cPart(imap)->octetCount < octetLength;

      // remove soft break for QP
      if (bufLen <= QP_ENC_MSG_LEN && buf[bufLen - 1] == '=' && cPart(imap)->xencoding == esp_mail_msg_part_xencoding_qp)
      {
        hrdBrk = false;
        buf[bufLen - 1] = 0;
        bufLen--;
      }

      size_t olen = 0;
      char *decoded = nullptr;
      bool newC = true;
      if (cPart(imap)->xencoding == esp_mail_msg_part_xencoding_base64)
      {
        decoded = (char *)decodeBase64((const unsigned char *)buf, bufLen, &olen);
      }
      else if (cPart(imap)->xencoding == esp_mail_msg_part_xencoding_qp)
      {
        decoded = (char *)newP(bufLen + 10);
        decodeQP(buf, decoded);
        olen = strlen(decoded);
      }
      else if (cPart(imap)->xencoding == esp_mail_msg_part_xencoding_7bit)
      {
        decoded = decode7Bit(buf);
        olen = strlen(decoded);
      }
      else
      {
        // 8bit and binary
        newC = false;
        decoded = buf;
        olen = bufLen;
      }

      if (decoded)
      {

        if ((rfc822_body_subtype && imap->_config->enable.rfc822) || (!rfc822_body_subtype && ((cPart(imap)->msg_type == esp_mail_msg_type_html && imap->_config->enable.html) || ((cPart(imap)->msg_type == esp_mail_msg_type_plain || cPart(imap)->msg_type == esp_mail_msg_type_enriched) && imap->_config->enable.text))))
        {

          if (getEncodingFromCharset(cPart(imap)->charset.c_str()) == esp_mail_char_decoding_scheme_iso8859_1)
          {
            int ilen = olen;
            int olen2 = (ilen + 1) * 2;
            unsigned char *tmp = (unsigned char *)newP(olen2);
            decodeLatin1_UTF8(tmp, &olen2, (unsigned char *)decoded, &ilen);
            delP(&decoded);
            olen = olen2;
            decoded = (char *)tmp;
          }
          else if (getEncodingFromCharset(cPart(imap)->charset.c_str()) == esp_mail_char_decoding_scheme_tis620)
          {
            char *out = (char *)newP((olen + 1) * 3);
            decodeTIS620_UTF8(out, decoded, olen);
            olen = strlen(out);
            delP(&decoded);
            decoded = out;
          }

          if (cPart(imap)->text.length() < imap->_config->limit.msg_size)
          {

            if (cPart(imap)->text.length() + olen < imap->_config->limit.msg_size)
            {
              cPart(imap)->textLen += olen;
              cPart(imap)->text.append(decoded, olen);
              if (hrdBrk)
              {
                cPart(imap)->text += MBSTRING_FLASH_MCR("\r\n");
                cPart(imap)->textLen += 2;
              }
            }
            else
            {
              int d = imap->_config->limit.msg_size - cPart(imap)->text.length();
              cPart(imap)->textLen += d;
              if (d > 0)
                cPart(imap)->text.append(decoded, d);

              if (hrdBrk)
              {
                cPart(imap)->text += MBSTRING_FLASH_MCR("\r\n");
                cPart(imap)->textLen += 2;
              }
            }
          }
        }

        if (filePath.length() > 0 && downloadRequest)
        {
          if (mbfs->ready(mbfs_type imap->_config->storage.type))
          {
            if (olen > 0)
              mbfs->write(mbfs_type imap->_config->storage.type, (uint8_t *)decoded, olen);
            if (hrdBrk)
              mbfs->write(mbfs_type imap->_config->storage.type, (uint8_t *)MBSTRING_FLASH_MCR("\r\n"), 2);
          }
        }

