Vladimir-Trufanov/ittve-ESP32-CAM/99-Фото ловушка на ESP32 CAM/ESP-Mail-Client-master/src/ESP_Mail_Client.cpp
  _customCmdResCallback = callback;

  MB_String _cmd = cmd;

  if (MailClient.imapSend(this, _cmd.c_str(), true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
    return false;

  _imap_cmd = esp_mail_imap_command::esp_mail_imap_cmd_custom;
  if (!MailClient.handleIMAPResponse(this, IMAP_STATUS_BAD_COMMAND, false))
    return false;

  return true;
}

bool IMAPSession::mDeleteFolder(MB_StringPtr folderName)
{
  if (_debug)
  {
    esp_mail_debug("");
    MailClient.debugInfoP(esp_mail_str_321);
  }

  MB_String cmd = esp_mail_str_323;
  cmd += folderName;

  if (MailClient.imapSend(this, cmd.c_str(), true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
    return false;

  _imap_cmd = esp_mail_imap_command::esp_mail_imap_cmd_delete;
  if (!MailClient.handleIMAPResponse(this, IMAP_STATUS_BAD_COMMAND, false))
    return false;

  return true;
}

bool IMAPSession::deleteMessages(MessageList *toDelete, bool expunge)
{
  if (toDelete->_list.size() > 0)
  {

    if (!selectFolder(_currentFolder.c_str(), false))
      return false;

    if (_debug)
    {
      esp_mail_debug("");
      MailClient.debugInfoP(esp_mail_str_316);
    }

    MB_String cmd = esp_mail_str_249;
    for (size_t i = 0; i < toDelete->_list.size(); i++)
    {
      if (i > 0)
        cmd += esp_mail_str_263;
      cmd += toDelete->_list[i];
    }
    cmd += esp_mail_str_315;

    if (MailClient.imapSend(this, cmd.c_str(), true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return false;

    _imap_cmd = esp_mail_imap_command::esp_mail_imap_cmd_store;
    if (!MailClient.handleIMAPResponse(this, IMAP_STATUS_BAD_COMMAND, false))
      return false;

    if (expunge)
    {
      if (MailClient.imapSendP(this, esp_mail_str_317, true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
        return false;

      _imap_cmd = esp_mail_imap_command::esp_mail_imap_cmd_expunge;
      if (!MailClient.handleIMAPResponse(this, IMAP_STATUS_BAD_COMMAND, false))
        return false;
    }
  }

  return true;
}

bool IMAPSession::mCopyMessages(MessageList *toCopy, MB_StringPtr dest)
{
  if (toCopy->_list.size() > 0)
  {

    if (!selectFolder(_currentFolder.c_str(), false))
      return false;

    if (_debug)
    {
      MB_String s = esp_mail_str_318;
      s += dest;
      esp_mail_debug(s.c_str());
    }

    MB_String cmd = esp_mail_str_319;
    for (size_t i = 0; i < toCopy->_list.size(); i++)
    {
      if (i > 0)
        cmd += esp_mail_str_263;
      cmd += toCopy->_list[i];
    }
    cmd += esp_mail_str_131;
    cmd += dest;

    if (MailClient.imapSend(this, cmd.c_str(), true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return false;

    _imap_cmd = esp_mail_imap_command::esp_mail_imap_cmd_store;
    if (!MailClient.handleIMAPResponse(this, IMAP_STATUS_BAD_COMMAND, false))
      return false;
  }

  return true;
}

void IMAPSession::empty()
{
  _nextUID.clear();
  _sdFileList.clear();
  clearMessageData();
}

String IMAPSession::fileList()
{
  return _sdFileList.c_str();
}

void IMAPSession::clearMessageData()
{
  for (size_t i = 0; i < _headers.size(); i++)
  {
    _headers[i].part_headers.clear();
  }
  _headers.clear();
  _msgUID.clear();
  _folders.clear();
  _mbif._flags.clear();
  _mbif._searchCount = 0;
  _flags_tmp.clear();
}

IMAP_Status::IMAP_Status()
{
}
IMAP_Status::~IMAP_Status()
{
  empty();
}

const char *IMAP_Status::info()
{
  return _info.c_str();
}

bool IMAP_Status::success()
{
  return _success;
}

void IMAP_Status::empty()
{
  _info.clear();
}

#endif

#if defined(ENABLE_SMTP)

int ESP_Mail_Client::readLine(SMTPSession *smtp, char *buf, int bufLen, bool crlf, int &count)
{
  int ret = -1;
  char c = 0;
  char _c = 0;
  int idx = 0;
  if (!smtp->client.connected())
    return idx;
  while (smtp->client.available() && idx < bufLen)
  {
    ret = smtp->client.read();
    if (ret > -1)
    {
      if (idx >= bufLen - 1)
        return idx;

      c = (char)ret;
      strcat_c(buf, c);
      idx++;
      count++;
      if (_c == '\r' && c == '\n')
      {
        if (!crlf)
        {
          buf[idx - 2] = 0;
          idx -= 2;
        }
        return idx;
      }
      _c = c;
    }
    if (!smtp->client.connected())
      return idx;
  }
  return idx;
}

void ESP_Mail_Client::mimeFromFile(const char *name, MB_String &mime)
{
  MB_String ext = name;
  size_t p = ext.find_last_of(".");
  if (p != MB_String::npos)
  {
    ext = ext.substr(p, ext.length() - p);
    if (ext.length() > 0)
      getMIME(ext.c_str(), mime);
  }
}

void ESP_Mail_Client::getMIME(const char *ext, MB_String &mime)
{
  mime.clear();
  for (int i = 0; i < esp_mail_file_extension_maxType; i++)
  {
    if (strcmp_P(ext, mimeinfo[i].endsWith) == 0)
    {
      mime += mimeinfo[i].mimeType;
      break;
    }
  }
}

MB_String ESP_Mail_Client::getEncodedToken(SMTPSession *smtp)
{
  MB_String raw = esp_mail_str_285;
  raw += smtp->_sesson_cfg->login.email;
  raw += esp_mail_str_286;
  raw += smtp->_sesson_cfg->login.accessToken;
  raw += esp_mail_str_287;
  return encodeBase64Str((const unsigned char *)raw.c_str(), raw.length());
}

bool ESP_Mail_Client::smtpAuth(SMTPSession *smtp)
{

  if (!reconnect(smtp))
    return false;

  bool ssl = false;
  smtp->_secure = true;
  bool secureMode = true;

  MB_String s;

#if defined(ESP32) && defined(ESP32_TCP_CLIENT)
  smtp->client.setDebugCallback(NULL);
#elif defined(ESP8266) && defined(ESP8266_TCP_CLIENT)
  smtp->client.rxBufDivider = 16; // minimum rx buffer for smtp status response
  smtp->client.txBufDivider = 8;  // medium tx buffer for faster attachment/inline data transfer
#endif

  if (smtp->_sesson_cfg->server.port == esp_mail_smtp_port_25)
  {
    smtp->_secure = false;
    secureMode = false;
  }
  else
  {
    if (smtp->_sesson_cfg->server.port == esp_mail_smtp_port_587)
      smtp->_sesson_cfg->secure.startTLS = true;

    secureMode = !smtp->_sesson_cfg->secure.startTLS;

    // to prevent to send the connection upgrade command when some server promotes
    // the starttls capability even the current connection was already secured.
    if (smtp->_sesson_cfg->server.port == esp_mail_smtp_port_465)
      ssl = true;
  }

#if defined(ESP32_TCP_CLIENT) || defined(ESP8266_TCP_CLIENT)
  setSecure(smtp->client, smtp->_sesson_cfg, smtp->_caCert);
#endif

  // Server connection attempt: no status code
  if (smtp->_sendCallback)
    smtpCBP(smtp, esp_mail_str_120);

  if (smtp->_debug)
  {
    s = esp_mail_str_314;
    s += ESP_MAIL_VERSION;
    s += smtp->client.fwVersion();
    esp_mail_debug(s.c_str());

#if defined(BOARD_HAS_PSRAM) && defined(MB_STRING_USE_PSRAM)
    if (ESP.getPsramSize() == 0)
    {
      s = esp_mail_str_353;
      esp_mail_debug(s.c_str());
    }
#endif

    debugInfoP(esp_mail_str_236);
    s = esp_mail_str_261;
    s += esp_mail_str_211;
    s += smtp->_sesson_cfg->server.host_name;
    esp_mail_debug(s.c_str());
    s = esp_mail_str_261;
    s += esp_mail_str_201;
    s += smtp->_sesson_cfg->server.port;
    esp_mail_debug(s.c_str());
  }
#if defined(ESP32) && defined(ESP32_TCP_CLIENT)
  if (smtp->_debug)
    smtp->client.setDebugCallback(esp_mail_debug);
#endif

  smtp->client.begin(smtp->_sesson_cfg->server.host_name.c_str(), smtp->_sesson_cfg->server.port);

