Vladimir-Trufanov/ittve-ESP32-CAM/99-Фото ловушка на ESP32 CAM/ESP-Mail-Client-master/src/ESP_Mail_Client.cpp
    if (i == msg->_rcp.size() - 1)
      buf2 += esp_mail_str_34;

    buf.clear();
    // only address
    buf += esp_mail_str_9;
    buf += esp_mail_str_14;
    buf += msg->_rcp[i].email;
    buf += esp_mail_str_15;

    // rfc3461, rfc3464
    if (smtp->_send_capability.dsn)
    {
      if (msg->response.notify != esp_mail_smtp_notify::esp_mail_smtp_notify_never)
      {
        buf += esp_mail_str_262;
        int opcnt = 0;
        if (msg->response.notify == esp_mail_smtp_notify::esp_mail_smtp_notify_success)
        {
          if (opcnt > 0)
            buf += esp_mail_str_263;
          buf += esp_mail_str_264;
          opcnt++;
        }
        if (msg->response.notify == esp_mail_smtp_notify::esp_mail_smtp_notify_failure)
        {
          if (opcnt > 0)
            buf += esp_mail_str_263;
          buf += esp_mail_str_265;
          opcnt++;
        }
        if (msg->response.notify == esp_mail_smtp_notify::esp_mail_smtp_notify_delay)
        {
          if (opcnt > 0)
            buf += esp_mail_str_263;
          buf += esp_mail_str_266;
          opcnt++;
        }
      }
    }

    if (smtpSend(smtp, buf.c_str(), true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return setSendingResult(smtp, msg, false);

    smtp->_smtp_cmd = esp_mail_smtp_command::esp_mail_smtp_cmd_send_header_recipient;
    if (!handleSMTPResponse(smtp, esp_mail_smtp_status_code_250, SMTP_STATUS_SEND_HEADER_RECIPIENT_FAILED))
      return setSendingResult(smtp, msg, false);
  }

  for (uint8_t i = 0; i < msg->_cc.size(); i++)
  {
    if (i == 0)
    {
      buf2 += esp_mail_str_12;
      buf2 += esp_mail_str_131;
      buf2 += esp_mail_str_14;
      buf2 += msg->_cc[i].email;
      buf2 += esp_mail_str_15;
    }
    else
    {
      buf2 += esp_mail_str_13;
      buf2 += msg->_cc[i].email;
      buf2 += esp_mail_str_15;
    }

    if (i == msg->_cc.size() - 1)
      buf2 += esp_mail_str_34;

    buf.clear();

    buf += esp_mail_str_9;
    buf += esp_mail_str_14;
    buf += msg->_cc[i].email;
    buf += esp_mail_str_15;

    if (smtpSend(smtp, buf.c_str(), true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return setSendingResult(smtp, msg, false);

    smtp->_smtp_cmd = esp_mail_smtp_command::esp_mail_smtp_cmd_send_header_recipient;
    if (!handleSMTPResponse(smtp, esp_mail_smtp_status_code_250, SMTP_STATUS_SEND_HEADER_RECIPIENT_FAILED))
      return setSendingResult(smtp, msg, false);
  }

  for (uint8_t i = 0; i < msg->_bcc.size(); i++)
  {
    buf = esp_mail_str_9;
    buf += esp_mail_str_14;
    buf += msg->_bcc[i].email;
    buf += esp_mail_str_15;
    if (smtpSend(smtp, buf.c_str(), true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return setSendingResult(smtp, msg, false);
    smtp->_smtp_cmd = esp_mail_smtp_command::esp_mail_smtp_cmd_send_header_recipient;
    if (!handleSMTPResponse(smtp, esp_mail_smtp_status_code_250, SMTP_STATUS_SEND_HEADER_RECIPIENT_FAILED))
      return setSendingResult(smtp, msg, false);
  }

  if (smtp->_sendCallback)
  {
    smtpCB(smtp, "");
    smtpCBP(smtp, esp_mail_str_126);
  }

  if (smtp->_debug)
    debugInfoP(esp_mail_str_243);

  if (smtp->_send_capability.chunking && msg->enable.chunking)
  {
    smtp->_chunkedEnable = true;
    if (!bdat(smtp, msg, buf2.length(), false))
      return false;
  }
  else
  {
    if (smtpSendP(smtp, esp_mail_str_16, true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return setSendingResult(smtp, msg, false);

    smtp->_smtp_cmd = esp_mail_smtp_command::esp_mail_smtp_cmd_send_body;
    if (!handleSMTPResponse(smtp, esp_mail_smtp_status_code_354, SMTP_STATUS_SEND_BODY_FAILED))
      return setSendingResult(smtp, msg, false);
  }

  if (smtpSend(smtp, buf2.c_str(), false) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
    return setSendingResult(smtp, msg, false);

  MB_String s = esp_mail_str_24;
  s += esp_mail_str_131;
  s += msg->subject;
  s += esp_mail_str_34;

  bool dateHdr = false;

  if (msg->_hdr.size() > 0)
  {
    for (uint8_t k = 0; k < msg->_hdr.size(); k++)
    {
      s += msg->_hdr[k];
      s += esp_mail_str_34;

      if (strcmpP(msg->_hdr[k].c_str(), 0, esp_mail_str_99, false))
        dateHdr = true;
    }
  }

  if (!dateHdr)
  {
    smtp->client.setSystemTime(Time.getCurrentTimestamp());
    time_t now = smtp->client.getTime();
    if (now > ESP_TIME_DEFAULT_TS)
    {
      s += esp_mail_str_99;
      s += esp_mail_str_131;
      s += Time.getDateTimeString();
      s += esp_mail_str_34;
    }
  }

  if (msg->response.reply_to.length() > 0)
  {
    s += esp_mail_str_184;
    s += esp_mail_str_131;
    s += esp_mail_str_14;
    s += msg->response.reply_to;
    s += esp_mail_str_15;
    s += esp_mail_str_34;
  }

  if (msg->response.return_path.length() > 0)
  {
    s += esp_mail_str_46;
    s += esp_mail_str_131;
    s += esp_mail_str_14;
    s += msg->response.return_path;
    s += esp_mail_str_15;
    s += esp_mail_str_34;
  }

  if (msg->in_reply_to.length() > 0)
  {
    s += esp_mail_str_109;
    s += esp_mail_str_131;
    s += msg->in_reply_to;
    s += esp_mail_str_34;
  }

  if (msg->references.length() > 0)
  {
    s += esp_mail_str_107;
    s += esp_mail_str_131;
    s += msg->references;
    s += esp_mail_str_34;
  }

  if (msg->comments.length() > 0)
  {
    s += esp_mail_str_134;
    s += esp_mail_str_131;
    s += msg->comments;
    s += esp_mail_str_34;
  }

  if (msg->keywords.length() > 0)
  {
    s += esp_mail_str_145;
    s += esp_mail_str_131;
    s += msg->keywords;
    s += esp_mail_str_34;
  }

  if (msg->messageID.length() > 0)
  {
    s += esp_mail_str_101;
    s += esp_mail_str_131;
    s += esp_mail_str_14;
    s += msg->messageID;
    s += esp_mail_str_15;
    s += esp_mail_str_34;
  }

  s += esp_mail_str_3;

  if (!bdat(smtp, msg, s.length(), false))
    return false;

  if (smtpSend(smtp, s.c_str(), false) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
    return setSendingResult(smtp, msg, false);

  return sendMSGData(smtp, msg, closeSession, rfc822MSG);
}

bool ESP_Mail_Client::sendMSGData(SMTPSession *smtp, SMTP_Message *msg, bool closeSession, bool rfc822MSG)
{
  MB_String s;
  MB_String mixed = getBoundary(15);
  MB_String alt = getBoundary(15);

  if (numAtt(smtp, esp_mail_att_type_attachment, msg) == 0 && msg->_parallel.size() == 0 && msg->_rfc822.size() == 0)
  {
    if (msg->type == (esp_mail_msg_type_plain | esp_mail_msg_type_html | esp_mail_msg_type_enriched) || numAtt(smtp, esp_mail_att_type_inline, msg) > 0)
    {
      if (!sendMSG(smtp, msg, alt))
        return setSendingResult(smtp, msg, false);
    }
    else if (msg->type != esp_mail_msg_type_none)
    {
      if (!sendPartText(smtp, msg, msg->type, ""))
        return setSendingResult(smtp, msg, false);
    }
  }
  else
  {
    s = esp_mail_str_1;
    s += mixed;
    s += esp_mail_str_35;

    s += esp_mail_str_33;
    s += mixed;
    s += esp_mail_str_34;

    if (!bdat(smtp, msg, s.length(), false))
      return false;

    if (smtpSend(smtp, s.c_str(), false) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return setSendingResult(smtp, msg, false);

    if (!sendMSG(smtp, msg, alt))
      return setSendingResult(smtp, msg, false);

    if (!bdat(smtp, msg, 2, false))
      return false;

    if (smtpSendP(smtp, esp_mail_str_34, false) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return setSendingResult(smtp, msg, false);

    if (smtp->_sendCallback)
    {
      smtpCB(smtp, "");
      smtpCBP(smtp, esp_mail_str_127);
    }

    if (smtp->_debug)
      debugInfoP(esp_mail_str_244);

    if (smtp->_sendCallback && numAtt(smtp, esp_mail_att_type_attachment, msg) > 0)
      esp_mail_debug("");

    if (!sendAttachments(smtp, msg, mixed))
      return setSendingResult(smtp, msg, false);

    if (!sendParallelAttachments(smtp, msg, mixed))
      return setSendingResult(smtp, msg, false);

    if (!sendRFC822Msg(smtp, msg, mixed, closeSession, msg->_rfc822.size() > 0))
      return setSendingResult(smtp, msg, false);

    s = esp_mail_str_33;
    s += mixed;
    s += esp_mail_str_33;

    if (!bdat(smtp, msg, s.length(), false))
      return false;

    if (smtpSend(smtp, s.c_str(), false) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return setSendingResult(smtp, msg, false);
  }

  if (!rfc822MSG)
  {
    if (smtp->_sendCallback)
    {
      smtpCB(smtp, "");
      smtpCBP(smtp, esp_mail_str_303);
    }

    if (smtp->_debug)
      debugInfoP(esp_mail_str_304);

    if (smtp->_chunkedEnable)
    {

