Vladimir-Trufanov/ittve-ESP32-CAM/99-Фото ловушка на ESP32 CAM/ESP-Mail-Client-master/src/ESP_Mail_Client.cpp
      if (!bdat(smtp, msg, 0, true))
        return false;

      smtp->_smtp_cmd = esp_mail_smtp_cmd_chunk_termination;
      if (!handleSMTPResponse(smtp, esp_mail_smtp_status_code_250, SMTP_STATUS_SEND_BODY_FAILED))
        return false;
    }
    else
    {
      if (smtpSendP(smtp, esp_mail_str_37, false) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
        return setSendingResult(smtp, msg, false);

      smtp->_smtp_cmd = esp_mail_smtp_command::esp_mail_smtp_cmd_send_body;
      if (!handleSMTPResponse(smtp, esp_mail_smtp_status_code_250, SMTP_STATUS_SEND_BODY_FAILED))
        return setSendingResult(smtp, msg, false);
    }

    setSendingResult(smtp, msg, true);

    if (closeSession)
      if (!smtp->closeSession())
        return false;
  }

  return true;
}

bool ESP_Mail_Client::sendRFC822Msg(SMTPSession *smtp, SMTP_Message *msg, const MB_String &boundary, bool closeSession, bool rfc822MSG)
{
  if (msg->_rfc822.size() == 0)
    return true;
  MB_String buf;
  for (uint8_t i = 0; i < msg->_rfc822.size(); i++)
  {
    buf.clear();
    getRFC822PartHeader(smtp, buf, boundary);

    getRFC822MsgEnvelope(smtp, &msg->_rfc822[i], buf);

    if (!bdat(smtp, msg, buf.length(), false))
      return false;

    if (smtpSend(smtp, buf.c_str(), false) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return false;

    if (!sendMSGData(smtp, &msg->_rfc822[i], closeSession, rfc822MSG))
      return false;
  }

  return true;
}

void ESP_Mail_Client::getRFC822MsgEnvelope(SMTPSession *smtp, SMTP_Message *msg, MB_String &buf)
{
  if (msg->date.length() > 0)
  {
    buf += esp_mail_str_99;
    buf += msg->date;
    buf += esp_mail_str_34;
  }
  else
  {
    smtp->client.setSystemTime(Time.getCurrentTimestamp());
    time_t now = smtp->client.getTime();
    if (now > ESP_TIME_DEFAULT_TS)
    {
      buf += esp_mail_str_99;
      buf += esp_mail_str_131;
      buf += Time.getDateTimeString();
      buf += esp_mail_str_34;
    }
  }

  if (msg->from.email.length() > 0)
  {
    buf += esp_mail_str_10;
    buf += esp_mail_str_131;

    if (msg->from.name.length() > 0)
      buf += msg->from.name;

    buf += esp_mail_str_14;
    buf += msg->from.email;
    buf += esp_mail_str_15;
    buf += esp_mail_str_34;
  }

  if (msg->sender.email.length() > 0)
  {
    buf += esp_mail_str_150;
    buf += esp_mail_str_131;

    if (msg->sender.name.length() > 0)
      buf += msg->sender.name;

    buf += esp_mail_str_14;
    buf += msg->sender.email;
    buf += esp_mail_str_15;
    buf += esp_mail_str_34;
  }

  if (msg->response.reply_to.length() > 0)
  {
    buf += esp_mail_str_184;
    buf += esp_mail_str_131;
    buf += esp_mail_str_14;
    buf += msg->response.reply_to;
    buf += esp_mail_str_15;
    buf += esp_mail_str_34;
  }

  if (msg->response.return_path.length() > 0)
  {
    buf += esp_mail_str_46;
    buf += esp_mail_str_131;
    buf += esp_mail_str_14;
    buf += msg->response.return_path;
    buf += esp_mail_str_15;
    buf += esp_mail_str_34;
  }

  for (uint8_t i = 0; i < msg->_rcp.size(); i++)
  {
    if (i == 0)
    {
      buf += esp_mail_str_11;
      buf += esp_mail_str_131;
      if (msg->_rcp[i].name.length() > 0)
        buf += msg->_rcp[i].name;

      buf += esp_mail_str_14;
      buf += msg->_rcp[i].email;
      buf += esp_mail_str_15;
    }
    else
    {
      if (msg->_rcp[i].name.length() > 0)
      {
        buf += esp_mail_str_263;
        buf += msg->_rcp[i].name;
        buf += esp_mail_str_14;
      }
      else
        buf += esp_mail_str_13;
      buf += msg->_rcp[i].email;
      buf += esp_mail_str_15;
    }

    if (i == msg->_rcp.size() - 1)
      buf += esp_mail_str_34;
  }

  for (uint8_t i = 0; i < msg->_cc.size(); i++)
  {
    if (i == 0)
    {
      buf += esp_mail_str_12;
      buf += esp_mail_str_131;
      buf += esp_mail_str_14;
      buf += msg->_cc[i].email;
      buf += esp_mail_str_15;
    }
    else
    {
      buf += esp_mail_str_13;
      buf += msg->_cc[i].email;
      buf += esp_mail_str_15;
    }

    if (i == msg->_cc.size() - 1)
      buf += esp_mail_str_34;
  }

  for (uint8_t i = 0; i < msg->_bcc.size(); i++)
  {
    if (i == 0)
    {
      buf += esp_mail_str_149;
      buf += esp_mail_str_14;
      buf += msg->_bcc[i].email;
      buf += esp_mail_str_15;
    }
    else
    {
      buf += esp_mail_str_13;
      buf += msg->_bcc[i].email;
      buf += esp_mail_str_15;
    }

    if (i == msg->_bcc.size() - 1)
      buf += esp_mail_str_34;
  }

  if (msg->subject.length() > 0)
  {
    buf += esp_mail_str_24;
    buf += esp_mail_str_131;
    buf += msg->subject;
    buf += esp_mail_str_34;
  }

  if (msg->keywords.length() > 0)
  {
    buf += esp_mail_str_145;
    buf += esp_mail_str_131;
    buf += msg->keywords;
    buf += esp_mail_str_34;
  }

  if (msg->comments.length() > 0)
  {
    buf += esp_mail_str_134;
    buf += esp_mail_str_131;
    buf += msg->comments;
    buf += esp_mail_str_34;
  }

  if (msg->in_reply_to.length() > 0)
  {
    buf += esp_mail_str_109;
    buf += esp_mail_str_131;
    buf += msg->in_reply_to;
    buf += esp_mail_str_34;
  }

  if (msg->references.length() > 0)
  {
    buf += esp_mail_str_107;
    buf += esp_mail_str_131;
    buf += msg->references;
    buf += esp_mail_str_34;
  }

  if (msg->messageID.length() > 0)
  {
    buf += esp_mail_str_101;
    buf += esp_mail_str_131;
    buf += esp_mail_str_14;
    buf += msg->messageID;
    buf += esp_mail_str_15;
    buf += esp_mail_str_34;
  }
}

bool ESP_Mail_Client::bdat(SMTPSession *smtp, SMTP_Message *msg, int len, bool last)
{
  if (!smtp->_chunkedEnable || !msg->enable.chunking)
    return true;

  smtp->_chunkCount++;

  MB_String bdat = esp_mail_str_106;
  bdat += len;
  if (last)
    bdat += esp_mail_str_173;

  if (smtpSend(smtp, bdat.c_str(), true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
    return setSendingResult(smtp, msg, false);

  if (!smtp->_send_capability.pipelining)
  {
    smtp->_smtp_cmd = esp_mail_smtp_command::esp_mail_smtp_cmd_send_body;
    if (!handleSMTPResponse(smtp, esp_mail_smtp_status_code_250, SMTP_STATUS_SEND_BODY_FAILED))
      return setSendingResult(smtp, msg, false);
    smtp->_chunkCount = 0;
  }
  return true;
}

void ESP_Mail_Client::checkBinaryData(SMTPSession *smtp, SMTP_Message *msg)
{
  if (msg->type & esp_mail_msg_type_plain || msg->type == esp_mail_msg_type_enriched || msg->type & esp_mail_msg_type_html)
  {
    if ((msg->type & esp_mail_msg_type_plain || msg->type == esp_mail_msg_type_enriched) > 0)
    {
      if (msg->text.transfer_encoding.length() > 0)
      {
        if (strcmp(msg->text.transfer_encoding.c_str(), Content_Transfer_Encoding::enc_binary) == 0)
        {
          msg->text._int.binary = true;
        }
      }
    }

    if ((msg->type & esp_mail_msg_type_html) > 0)
    {
      if (msg->html.transfer_encoding.length() > 0)
      {
        if (strcmp(msg->html.transfer_encoding.c_str(), Content_Transfer_Encoding::enc_binary) == 0)
        {
          msg->html._int.binary = true;
        }
      }
    }
  }

  for (size_t i = 0; i < msg->_att.size(); i++)
  {
    if (strcmpP(msg->_att[i].descr.transfer_encoding.c_str(), 0, esp_mail_str_166))
    {
      msg->_att[i]._int.binary = true;
    }
  }
}

bool ESP_Mail_Client::sendBlob(SMTPSession *smtp, SMTP_Message *msg, SMTP_Attachment *att)
{
  if (strcmp(att->descr.transfer_encoding.c_str(), Content_Transfer_Encoding::enc_base64) == 0 && strcmp(att->descr.transfer_encoding.c_str(), att->descr.content_encoding.c_str()) != 0)
  {
    if (!sendBase64(smtp, msg, (const unsigned char *)att->blob.data, att->blob.size, att->_int.flash_blob, att->descr.filename.c_str(), smtp->_sendCallback != NULL))
      return false;
    return true;
  }
  else
  {
    if (att->blob.size > 0)
    {
      if (strcmp(att->descr.content_encoding.c_str(), Content_Transfer_Encoding::enc_base64) == 0)
      {
        if (!sendBase64Raw(smtp, msg, att->blob.data, att->blob.size, att->_int.flash_blob, att->descr.filename.c_str(), smtp->_sendCallback != NULL))
          return false;
        return true;
      }
      else
      {

        size_t chunkSize = ESP_MAIL_CLIENT_STREAM_CHUNK_SIZE;
        size_t writeLen = 0;
        uint8_t *buf = (uint8_t *)newP(chunkSize);
        while (writeLen < att->blob.size)
        {
          if (writeLen > att->blob.size - chunkSize)
            chunkSize = att->blob.size - writeLen;

          if (!bdat(smtp, msg, chunkSize, false))
            break;
          memcpy_P(buf, att->blob.data, chunkSize);
          if (smtpSend(smtp, buf, chunkSize) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
            break;

          if (smtp->_sendCallback)
            uploadReport(att->descr.filename.c_str(), smtp->_lastProgress, 100 * writeLen / att->blob.size);

          writeLen += chunkSize;
        }
        delP(&buf);

        if (smtp->_sendCallback)
          uploadReport(att->descr.filename.c_str(), smtp->_lastProgress, 100);

        return writeLen >= att->blob.size;
      }
    }
  }
  return false;
}

bool ESP_Mail_Client::sendFile(SMTPSession *smtp, SMTP_Message *msg, SMTP_Attachment *att)
{
  smtp->_lastProgress = -1;

  if (strcmp(att->descr.transfer_encoding.c_str(), Content_Transfer_Encoding::enc_base64) == 0 && strcmp(att->descr.transfer_encoding.c_str(), att->descr.content_encoding.c_str()) != 0)
  {
    if (!sendBase64Stream(smtp, msg, att->file.storage_type, att->descr.filename.c_str(), smtp->_sendCallback != NULL))
      return false;
    return true;
  }
  else
  {
    if (mbfs->size(mbfs_type att->file.storage_type) > 0)
    {
      if (strcmp(att->descr.content_encoding.c_str(), Content_Transfer_Encoding::enc_base64) == 0)
      {
        if (!sendBase64StreamRaw(smtp, msg, att->file.storage_type, att->descr.filename.c_str(), smtp->_sendCallback != NULL))
          return false;
        return true;
      }
      else
      {
        int chunkSize = ESP_MAIL_CLIENT_STREAM_CHUNK_SIZE;
        int writeLen = 0;

        int fileSize = mbfs->size(mbfs_type att->file.storage_type);

