Vladimir-Trufanov/ittve-ESP32-CAM/99-Фото ловушка на ESP32 CAM/ESP-Mail-Client-master/src/ESP_Mail_Client.cpp
        if (fileSize < chunkSize)
          chunkSize = fileSize;

        uint8_t *buf = (uint8_t *)newP(chunkSize);
        while (writeLen < fileSize && mbfs->available(mbfs_type att->file.storage_type))
        {
          if (writeLen > fileSize - chunkSize)
            chunkSize = fileSize - writeLen;
          int readLen = mbfs->read(mbfs_type att->file.storage_type, buf, chunkSize);
          if (readLen != chunkSize)
          {
            errorStatusCB(smtp, MB_FS_ERROR_FILE_IO_ERROR);
            break;
          }

          if (!bdat(smtp, msg, chunkSize, false))
            break;

          if (smtpSend(smtp, buf, chunkSize) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
            break;

          if (smtp->_sendCallback)
            uploadReport(att->descr.filename.c_str(), smtp->_lastProgress, 100 * writeLen / fileSize);
          writeLen += chunkSize;
        }
        delP(&buf);
        if (smtp->_sendCallback)
          uploadReport(att->descr.filename.c_str(), smtp->_lastProgress, 100);
        return writeLen == fileSize;
      }
    }
    return false;
  }
  return false;
}

bool ESP_Mail_Client::sendParallelAttachments(SMTPSession *smtp, SMTP_Message *msg, const MB_String &boundary)
{
  if (msg->_parallel.size() == 0)
    return true;

  MB_String parallel = getBoundary(15);
  MB_String buf = esp_mail_str_33;
  buf += boundary;
  buf += esp_mail_str_34;

  buf += esp_mail_str_28;
  buf += parallel;
  buf += esp_mail_str_35;

  if (!bdat(smtp, msg, buf.length(), false))
    return false;

  if (smtpSend(smtp, buf.c_str(), false) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
    return setSendingResult(smtp, msg, false);

  if (!sendAttachments(smtp, msg, parallel, true))
    return setSendingResult(smtp, msg, false);

  buf = esp_mail_str_33;
  buf += parallel;
  buf += esp_mail_str_33;

  if (!bdat(smtp, msg, buf.length(), false))
    return false;

  if (smtpSend(smtp, buf.c_str(), false) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
    return setSendingResult(smtp, msg, false);

  return true;
}

bool ESP_Mail_Client::sendAttachments(SMTPSession *smtp, SMTP_Message *msg, const MB_String &boundary, bool parallel)
{
  MB_String s;
  MB_String buf;
  int cnt = 0;

  SMTP_Attachment *att = nullptr;

  size_t sz = msg->_att.size();
  if (parallel)
    sz = msg->_parallel.size();

  for (size_t i = 0; i < sz; i++)
  {
    if (parallel)
      att = &msg->_parallel[i];
    else
      att = &msg->_att[i];

    if (att->_int.att_type == esp_mail_att_type_attachment)
    {
      s = esp_mail_str_261;
      s += att->descr.filename;

      if (smtp->_sendCallback)
      {
        if (cnt > 0)
          smtpCB(smtp, "");
        smtpCB(smtp, att->descr.filename.c_str());
      }

      if (smtp->_debug)
        esp_mail_debug(s.c_str());

      cnt++;

      if (att->file.storage_type == esp_mail_file_storage_type_none)
      {
        if (!att->blob.data)
          continue;

        if (att->blob.size == 0)
          continue;

        if (smtp->_sendCallback)
          smtpCB(smtp, att->descr.filename.c_str());

        if (smtp->_debug)
          esp_mail_debug(s.c_str());

        buf.clear();
        getAttachHeader(buf, boundary, att, att->blob.size);

        if (!bdat(smtp, msg, buf.length(), false))
          return false;

        if (smtpSend(smtp, buf.c_str(), false) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
          return false;

        if (!sendBlob(smtp, msg, att))
          return false;

        if (!bdat(smtp, msg, 2, false))
          return false;

        if (smtpSendP(smtp, esp_mail_str_34, false) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
          return false;
      }
      else
      {

        if (!mbfs->checkStorageReady(mbfs_type att->file.storage_type))
        {
          sendStorageNotReadyError(smtp, att->file.storage_type);
          continue;
        }

        if (openFileRead(smtp, msg, att, s, buf, boundary, false))
        {

          if (!sendFile(smtp, msg, att))
            return false;

          if (!bdat(smtp, msg, 2, false))
            return false;

          if (smtpSendP(smtp, esp_mail_str_34, false) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
            return false;
        }
      }
    }
  }
  return true;
}

bool ESP_Mail_Client::openFileRead(SMTPSession *smtp, SMTP_Message *msg, SMTP_Attachment *att, MB_String &s, MB_String &buf, const MB_String &boundary, bool inlined)
{
  int sz = -1;
  MB_String filepath;

  if (att->file.path.length() > 0)
  {
    if (att->file.path[0] != '/')
      filepath = esp_mail_str_202;
    filepath += att->file.path;
  }

  sz = mbfs->open(filepath, mbfs_type att->file.storage_type, mb_fs_open_mode_read);
  if (sz < 0)
  {

    if (strlen(att->descr.filename.c_str()) > 0)
    {
      filepath.clear();
      if (att->descr.filename[0] != '/')
        filepath = esp_mail_str_202;
      filepath += att->descr.filename;
    }

    sz = mbfs->open(filepath, mbfs_type att->file.storage_type, mb_fs_open_mode_read);
  }

  if (sz < 0)
  {
    if (smtp->_sendCallback)
      debugInfoP(esp_mail_str_158);

    if (smtp->_debug)
    {
      smtp->_smtpStatus.statusCode = sz;
      smtp->_smtpStatus.text.clear();

      MB_String e = esp_mail_str_185;
      e += smtp->errorReason().c_str();
      esp_mail_debug_line(e.c_str(), true);
    }
  }
  else
  {

    buf.clear();

    if (inlined)
      getInlineHeader(buf, boundary, att, sz);
    else
      getAttachHeader(buf, boundary, att, sz);

    if (!bdat(smtp, msg, buf.length(), false))
      return false;

    if (smtpSend(smtp, buf.c_str(), false) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return false;

    return true;
  }

  return false;
}

bool ESP_Mail_Client::openFileRead2(SMTPSession *smtp, SMTP_Message *msg, const char *path, esp_mail_file_storage_type storageType)
{

  MB_String filepath;

  if (strlen(path) > 0)
  {
    if (path[0] != '/')
      filepath = esp_mail_str_202;
    filepath += path;
  }

  int sz = mbfs->open(filepath, mbfs_type storageType, mb_fs_open_mode_read);
  if (sz < 0)
  {
    if (smtp->_sendCallback)
      debugInfoP(esp_mail_str_158);

    if (smtp->_debug)
    {
      smtp->_smtpStatus.statusCode = sz;
      smtp->_smtpStatus.text.clear();

