Vladimir-Trufanov/ittve-ESP32-CAM/99-Фото ловушка на ESP32 CAM/ESP-Mail-Client-master/src/ESP_Mail_Client.cpp
      MB_String e = esp_mail_str_185;
      e += smtp->errorReason().c_str();
      esp_mail_debug_line(e.c_str(), true);
    }

    return false;
  }

  return true;
}

#if defined(ENABLE_SMTP)
void ESP_Mail_Client::sendStorageNotReadyError(SMTPSession *smtp, esp_mail_file_storage_type storageType)
{

#if defined(MBFS_FLASH_FS) || defined(MBFS_SD_FS)

  if (smtp->_sendCallback)
  {
    if (storageType == esp_mail_file_storage_type_flash)
      debugInfoP(esp_mail_str_348);
    else if (storageType == esp_mail_file_storage_type_sd)
      debugInfoP(esp_mail_str_349);
  }

  if (smtp->_debug)
  {
    MB_String e = esp_mail_str_185;
    if (storageType == esp_mail_file_storage_type_flash)
      e += esp_mail_str_348;
    else if (storageType == esp_mail_file_storage_type_sd)
      e += esp_mail_str_349;
    esp_mail_debug(e.c_str());
  }
#endif
}
#endif

#if defined(ENABLE_IMAP)
void ESP_Mail_Client::sendStorageNotReadyError(IMAPSession *imap, esp_mail_file_storage_type storageType)
{

#if defined(MBFS_FLASH_FS) || defined(MBFS_SD_FS)
  if (imap->_debug)
  {
    MB_String e = esp_mail_str_185;
    if (storageType == esp_mail_file_storage_type_flash)
      e += esp_mail_str_348;
    else if (storageType == esp_mail_file_storage_type_sd)
      e += esp_mail_str_349;
    esp_mail_debug(e.c_str());
  }
#endif
}
#endif

bool ESP_Mail_Client::sendInline(SMTPSession *smtp, SMTP_Message *msg, const MB_String &boundary, byte type)
{
  size_t num = numAtt(smtp, esp_mail_att_type_inline, msg) > 0;

  if (num > 0)
  {
    if (smtp->_sendCallback)
    {
      smtpCB(smtp, "");
      smtpCBP(smtp, esp_mail_str_167);
    }

    if (smtp->_debug)
      debugInfoP(esp_mail_str_271);
  }

  MB_String buf;
  MB_String related = getBoundary(15);
  int cnt = 0;
  SMTP_Attachment *att = nullptr;

  MB_String s = esp_mail_str_33;
  s += boundary;
  s += esp_mail_str_34;

  s += esp_mail_str_298;
  s += related;
  s += esp_mail_str_35;

  if (!bdat(smtp, msg, s.length(), false))
    return false;

  if (smtpSend(smtp, s.c_str()) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
    return false;

  if (!sendPartText(smtp, msg, type, related.c_str()))
    return false;

  if (smtp->_sendCallback && numAtt(smtp, esp_mail_att_type_inline, msg) > 0)
    esp_mail_debug("");

  if (num > 0)
  {
    for (uint8_t i = 0; i < msg->_att.size(); i++)
    {
      att = &msg->_att[i];
      if (att->_int.att_type == esp_mail_att_type_inline)
      {
        s = esp_mail_str_261;
        s += att->descr.filename;

        if (smtp->_sendCallback)
        {
          if (cnt > 0)
            smtpCB(smtp, "");
          smtpCB(smtp, att->descr.filename.c_str());
        }

        if (smtp->_debug)
          esp_mail_debug(s.c_str());

        cnt++;

        if (att->file.storage_type == esp_mail_file_storage_type_none)
        {
          if (!att->blob.data)
            continue;

          if (att->blob.size == 0)
            continue;

          if (smtp->_sendCallback)
            smtpCB(smtp, att->descr.filename.c_str());

          if (smtp->_debug)
            esp_mail_debug(s.c_str());

          buf.clear();
          getInlineHeader(buf, related, att, att->blob.size);

          if (!bdat(smtp, msg, buf.length(), false))
            return false;

          if (smtpSend(smtp, buf.c_str(), false) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
            return false;

          if (!sendBlob(smtp, msg, att))
            return false;

          if (!bdat(smtp, msg, 2, false))
            return false;

          if (smtpSendP(smtp, esp_mail_str_34, false) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
            return false;
        }
        else
        {

          if (!mbfs->checkStorageReady(mbfs_type att->file.storage_type))
          {
            sendStorageNotReadyError(smtp, att->file.storage_type);
            continue;
          }

          if (openFileRead(smtp, msg, att, s, buf, related, true))
          {
            if (!sendFile(smtp, msg, att))
              return false;

            if (!bdat(smtp, msg, 2, false))
              return false;

            if (smtpSendP(smtp, esp_mail_str_34, false) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
              return false;
          }
        }
      }
    }
  }

  s = esp_mail_str_34;
  s += esp_mail_str_33;
  s += related;
  s += esp_mail_str_33;
  s += esp_mail_str_34;

  if (!bdat(smtp, msg, s.length(), false))
    return false;

  if (smtpSend(smtp, s.c_str(), false) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
    return false;

  return true;
}

void ESP_Mail_Client::errorStatusCB(SMTPSession *smtp, int error)
{
  smtp->_smtpStatus.statusCode = error;
  MB_String s;

  if (smtp->_sendCallback)
  {
    s += esp_mail_str_53;
    s += smtp->errorReason().c_str();
    smtpCB(smtp, s.c_str(), false);
  }

  if (smtp->_debug)
  {
    s = esp_mail_str_185;
    s += smtp->errorReason().c_str();
    esp_mail_debug(s.c_str());
  }
}

size_t ESP_Mail_Client::smtpSendP(SMTPSession *smtp, PGM_P v, bool newline)
{
  if (!reconnect(smtp))
  {
    closeTCPSession(smtp);
    return 0;
  }

  if (!connected(smtp))
  {
    errorStatusCB(smtp, MAIL_CLIENT_ERROR_CONNECTION_CLOSED);
    return 0;
  }

  if (!smtp->_tcpConnected)
  {
    errorStatusCB(smtp, MAIL_CLIENT_ERROR_SERVER_CONNECTION_FAILED);
    return 0;
  }

  int len = 0;

  MB_String s1 = v;

  if (newline)
  {
    if (smtp->_debugLevel > esp_mail_debug_level_2)
      esp_mail_debug(s1.c_str());
    len = smtp->client.println(s1.c_str());
  }
  else
  {
    if (smtp->_debugLevel > esp_mail_debug_level_2)
      esp_mail_debug_line(s1.c_str(), false);
    len = smtp->client.print(s1.c_str());
  }

  if (len != (int)s1.length() && len != (int)s1.length() + 2)
  {
    errorStatusCB(smtp, len);
    len = 0;
  }

  return len;
}

size_t ESP_Mail_Client::smtpSend(SMTPSession *smtp, const char *data, bool newline)
{
  if (!reconnect(smtp))
  {
    closeTCPSession(smtp);
    return 0;
  }

  if (!connected(smtp))
  {
    errorStatusCB(smtp, MAIL_CLIENT_ERROR_CONNECTION_CLOSED);
    return 0;
  }

  if (!smtp->_tcpConnected)
  {
    errorStatusCB(smtp, MAIL_CLIENT_ERROR_SERVER_CONNECTION_FAILED);
    return 0;
  }

  int len = 0;

  if (newline)
  {
    if (smtp->_debugLevel > esp_mail_debug_level_2)
      esp_mail_debug(data);
    len = smtp->client.println(data);
  }
  else
  {
    if (smtp->_debugLevel > esp_mail_debug_level_2)
      esp_mail_debug_line(data, false);
    len = smtp->client.print(data);
  }

  if (len != (int)strlen(data) && len != (int)strlen(data) + 2)
  {
    errorStatusCB(smtp, len);
    len = 0;
  }

  return len;
}

