Vladimir-Trufanov/ittve-ESP32-CAM/99-Фото ловушка на ESP32 CAM/ESP-Mail-Client-master/src/ESP_Mail_Client.cpp
size_t ESP_Mail_Client::smtpSend(SMTPSession *smtp, int data, bool newline)
{
  if (!reconnect(smtp))
  {
    closeTCPSession(smtp);
    return 0;
  }

  if (!connected(smtp))
  {
    errorStatusCB(smtp, MAIL_CLIENT_ERROR_CONNECTION_CLOSED);
    return 0;
  }

  if (!smtp->_tcpConnected)
  {
    errorStatusCB(smtp, MAIL_CLIENT_ERROR_SERVER_CONNECTION_FAILED);
    return 0;
  }

  int len = 0;

  if (newline)
  {
    if (smtp->_debugLevel > esp_mail_debug_level_2)
      esp_mail_debug(num2Str(data, 0));
    len = smtp->client.println(data);
  }
  else
  {
    if (smtp->_debugLevel > esp_mail_debug_level_2)
      esp_mail_debug_line(num2Str(data, 0), false);
    len = smtp->client.print(data);
  }

  if (len != (int)strlen(num2Str(data, 0)) && len != (int)strlen(num2Str(data, 0)) + 2)
  {
    errorStatusCB(smtp, len);
    len = 0;
  }

  return len;
}

size_t ESP_Mail_Client::smtpSend(SMTPSession *smtp, uint8_t *data, size_t size)
{
  if (!reconnect(smtp))
  {
    closeTCPSession(smtp);
    return 0;
  }

  if (!connected(smtp))
  {
    errorStatusCB(smtp, MAIL_CLIENT_ERROR_CONNECTION_CLOSED);
    return 0;
  }

  if (!smtp->_tcpConnected)
  {
    errorStatusCB(smtp, MAIL_CLIENT_ERROR_SERVER_CONNECTION_FAILED);
    return 0;
  }

  size_t len = 0;

  len = smtp->client.write(data, size);

  if (len != size)
  {
    errorStatusCB(smtp, len);
    len = 0;
  }

  return len;
}

bool ESP_Mail_Client::handleSMTPError(SMTPSession *smtp, int err, bool ret)
{
  if (err < 0)
    errorStatusCB(smtp, err);

  if (smtp->_tcpConnected)
    closeTCPSession(smtp);

  return ret;
}

bool ESP_Mail_Client::sendPartText(SMTPSession *smtp, SMTP_Message *msg, uint8_t type, const char *boundary)
{
  MB_String header;

  if (strlen(boundary) > 0)
  {
    header += esp_mail_str_33;
    header += boundary;
    header += esp_mail_str_34;
  }

  if (type == esp_mail_msg_type_plain || type == esp_mail_msg_type_enriched)
  {
    if (msg->text.content_type.length() > 0)
    {
      header += esp_mail_str_25;
      header += esp_mail_str_131;
      header += msg->text.content_type;

      if (msg->text.charSet.length() > 0)
      {
        header += esp_mail_str_97;
        header += esp_mail_str_131;
        header += esp_mail_str_168;
        header += msg->text.charSet;
        header += esp_mail_str_136;
      }

      if (msg->text.flowed)
      {
        header += esp_mail_str_97;
        header += esp_mail_str_131;
        header += esp_mail_str_270;

        header += esp_mail_str_97;
        header += esp_mail_str_131;
        header += esp_mail_str_110;
      }

      if (msg->text.embed.enable)
      {
        header += esp_mail_str_26;
        header += esp_mail_str_164;
        header += esp_mail_str_136;
        char *tmp = getRandomUID();
        msg->text._int.cid = tmp;
        delP(&tmp);
      }

      header += esp_mail_str_34;
    }

    if (msg->text.transfer_encoding.length() > 0)
    {
      header += esp_mail_str_272;
      header += msg->text.transfer_encoding;
      header += esp_mail_str_34;
    }
  }
  else if (type == esp_mail_msg_type_html)
  {
    if (msg->text.content_type.length() > 0)
    {
      header += esp_mail_str_25;
      header += esp_mail_str_131;
      header += msg->html.content_type;

      if (msg->html.charSet.length() > 0)
      {
        header += esp_mail_str_97;
        header += esp_mail_str_131;
        header += esp_mail_str_168;
        header += msg->html.charSet;
        header += esp_mail_str_136;
      }
      if (msg->html.embed.enable)
      {
        header += esp_mail_str_26;
        header += esp_mail_str_159;
        header += esp_mail_str_136;
        char *tmp = getRandomUID();
        msg->html._int.cid = tmp;
        delP(&tmp);
      }
      header += esp_mail_str_34;
    }

    if (msg->html.transfer_encoding.length() > 0)
    {
      header += esp_mail_str_272;
      header += msg->html.transfer_encoding;
      header += esp_mail_str_34;
    }
  }

  if ((type == esp_mail_msg_type_html && msg->html.embed.enable) || ((type == esp_mail_msg_type_plain || type == esp_mail_msg_type_enriched) && msg->text.embed.enable))
  {

    if ((type == esp_mail_msg_type_plain || type == esp_mail_msg_type_enriched) && msg->text.embed.enable)
    {
      if (msg->text.embed.type == esp_mail_smtp_embed_message_type_attachment)
        header += esp_mail_str_30;
      else if (msg->text.embed.type == esp_mail_smtp_embed_message_type_inline)
        header += esp_mail_str_299;

      if (msg->text.embed.filename.length() > 0)
        header += msg->text.embed.filename;
      else
        header += esp_mail_str_164;
      header += esp_mail_str_36;

      if (msg->text.embed.type == esp_mail_smtp_embed_message_type_inline)
      {
        header += esp_mail_str_300;
        if (msg->text.embed.filename.length() > 0)
          header += msg->text.embed.filename;
        else
          header += esp_mail_str_159;
        header += esp_mail_str_34;

        header += esp_mail_str_301;
        header += msg->text._int.cid;
        header += esp_mail_str_15;
        header += esp_mail_str_34;
      }
    }
    else if (type == esp_mail_msg_type_html && msg->html.embed.enable)
    {
      if (msg->html.embed.type == esp_mail_smtp_embed_message_type_attachment)
        header += esp_mail_str_30;
      else if (msg->html.embed.type == esp_mail_smtp_embed_message_type_inline)
        header += esp_mail_str_299;

      if (msg->html.embed.filename.length() > 0)
        header += msg->html.embed.filename;
      else
        header += esp_mail_str_159;
      header += esp_mail_str_36;

      if (msg->html.embed.type == esp_mail_smtp_embed_message_type_inline)
      {
        header += esp_mail_str_300;
        if (msg->html.embed.filename.length() > 0)
          header += msg->html.embed.filename;
        else
          header += esp_mail_str_159;
        header += esp_mail_str_34;

        header += esp_mail_str_301;
        header += msg->html._int.cid;
        header += esp_mail_str_15;
        header += esp_mail_str_34;
      }
    }
  }

  header += esp_mail_str_34;


  bool rawBlob = (msg->text.blob.size > 0 && (type == esp_mail_msg_type_plain || type == esp_mail_msg_type_enriched)) || (msg->html.blob.size > 0 && type == esp_mail_msg_type_html);
  bool rawFile = (msg->text.file.name.length() > 0 && (type == esp_mail_msg_type_plain || type == esp_mail_msg_type_enriched)) || (msg->html.file.name.length() > 0 && type == esp_mail_msg_type_html);
  bool rawContent = ((type == esp_mail_msg_type_plain || type == esp_mail_msg_type_enriched) && msg->text.content.length() > 0) || (type == esp_mail_msg_type_html && msg->html.content.length() > 0);
  bool nonCopyContent = ((type == esp_mail_msg_type_plain || type == esp_mail_msg_type_enriched) && strlen(msg->text.nonCopyContent) > 0) || (type == esp_mail_msg_type_html && strlen(msg->html.nonCopyContent) > 0);
 
  if (rawBlob || rawFile || nonCopyContent)
  {
    if (!bdat(smtp, msg, header.length(), false))
      return false;

    if (smtpSend(smtp, header.c_str()) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return false;

