Vladimir-Trufanov/ittve-ESP32-CAM/99-Фото ловушка на ESP32 CAM/ESP-Mail-Client-master/src/ESP_Mail_Client.cpp
    header.clear();

    if (rawBlob || nonCopyContent)
    {
      if (!sendBlobBody(smtp, msg, type))
        return false;
    }
    else if (rawFile)
    {
      if (!sendFileBody(smtp, msg, type))
        return false;
    }
  }
  else if (rawContent)
    encodingText(smtp, msg, type, header);

  header += esp_mail_str_34;

  if (strlen(boundary) > 0)
    header += esp_mail_str_34;

  if (!bdat(smtp, msg, header.length(), false))
    return false;

  if (smtpSend(smtp, header.c_str()) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
    return false;

  return true;
}

bool ESP_Mail_Client::sendBlobBody(SMTPSession *smtp, SMTP_Message *msg, uint8_t type)
{

  smtp->_lastProgress = -1;

  if (msg->text.blob.size == 0 && msg->html.blob.size == 0 && strlen(msg->text.nonCopyContent) == 0 && strlen(msg->html.nonCopyContent) == 0)
    return true;

  bool ret = true;
  int bufLen = 512;
  size_t pos = 0;

  const uint8_t *raw = NULL;
  int len = 0;
  bool base64 = false;

  if ((type == esp_mail_msg_type_plain || type == esp_mail_msg_type_enriched))
  {
    if (strlen(msg->text.nonCopyContent) > 0)
    {
      raw = (const uint8_t *)msg->text.nonCopyContent;
      len = strlen(msg->text.nonCopyContent);
    }
    else
    {
      raw = msg->text.blob.data;
      len = msg->text.blob.size;
    }
    base64 = msg->text.transfer_encoding.length() > 0 && strcmp(msg->text.transfer_encoding.c_str(), Content_Transfer_Encoding::enc_base64) == 0;
  }
  else if (type == esp_mail_msg_type_html)
  {
    if (strlen(msg->html.nonCopyContent) > 0)
    {
      raw = (const uint8_t *)msg->html.nonCopyContent;
      len = strlen(msg->html.nonCopyContent);
    }
    else
    {
      raw = msg->html.blob.data;
      len = msg->html.blob.size;
    }
    base64 = msg->html.transfer_encoding.length() > 0 && strcmp(msg->html.transfer_encoding.c_str(), Content_Transfer_Encoding::enc_base64) == 0;
  }

  if (base64)
  {
    MB_String s1 = esp_mail_str_325;
    return sendBase64(smtp, msg, (const unsigned char *)raw, len, true, s1.c_str(), smtp->_sendCallback != NULL);
  }

  int available = len;
  int sz = len;
  uint8_t *buf = (uint8_t *)newP(bufLen + 1);
  while (available)
  {
    if (available > bufLen)
      available = bufLen;

    memcpy_P(buf, raw + pos, available);

    if (!bdat(smtp, msg, available, false))
    {
      ret = false;
      break;
    }

    if (smtpSend(smtp, buf, available) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
    {
      ret = false;
      break;
    }

    pos += available;
    len -= available;
    available = len;
    if (smtp->_sendCallback)
    {
      MB_String s1 = esp_mail_str_325;
      uploadReport(s1.c_str(), smtp->_lastProgress, 100 * pos / sz);
    }
  }
  delP(&buf);

  return ret;
}

bool ESP_Mail_Client::sendFileBody(SMTPSession *smtp, SMTP_Message *msg, uint8_t type)
{
  smtp->_lastProgress = -1;

  if (msg->text.file.name.length() == 0 && msg->html.file.name.length() == 0)
    return true;

  bool ret = true;
  int chunkSize = ESP_MAIL_CLIENT_STREAM_CHUNK_SIZE;
  int writeLen = 0;

  if (type == esp_mail_msg_type_plain || type == esp_mail_msg_type_enriched)
  {

    if (!openFileRead2(smtp, msg, msg->text.file.name.c_str(), msg->text.file.type))
      return false;

    if (msg->text.transfer_encoding.length() > 0)
    {
      if (strcmp(msg->text.transfer_encoding.c_str(), Content_Transfer_Encoding::enc_base64) == 0)
      {
        MB_String s1 = esp_mail_str_326;
        return sendBase64Stream(smtp, msg, msg->text.file.type, s1.c_str(), smtp->_sendCallback != NULL);
      }
    }

    int fileSize = mbfs->size(mbfs_type msg->text.file.type);

    if (fileSize > 0)
    {

      if (fileSize < chunkSize)
        chunkSize = fileSize;
      uint8_t *buf = (uint8_t *)newP(chunkSize);
      while (writeLen < fileSize && mbfs->available(mbfs_type msg->text.file.type))
      {
        if (writeLen > fileSize - chunkSize)
          chunkSize = fileSize - writeLen;
        int readLen = mbfs->read(mbfs_type msg->text.file.type, buf, chunkSize);

        if (readLen != chunkSize)
        {
          errorStatusCB(smtp, MB_FS_ERROR_FILE_IO_ERROR);
          break;
        }

        if (!bdat(smtp, msg, chunkSize, false))
        {
          ret = false;
          break;
        }

        if (smtpSend(smtp, buf, chunkSize) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
        {
          ret = false;
          break;
        }

        if (smtp->_sendCallback)
        {
          MB_String s1 = esp_mail_str_326;
          uploadReport(s1.c_str(), smtp->_lastProgress, 100 * writeLen / fileSize);
        }
        writeLen += chunkSize;
      }
      delP(&buf);
      if (smtp->_sendCallback)
      {
        MB_String s1 = esp_mail_str_326;
        uploadReport(s1.c_str(), smtp->_lastProgress, 100);
      }

      return ret && writeLen == fileSize;
    }
  }
  else if (type == esp_mail_message_type::esp_mail_msg_type_html)
  {

    if (!openFileRead2(smtp, msg, msg->html.file.name.c_str(), msg->html.file.type))
      return false;

    if (msg->html.transfer_encoding.length() > 0)
    {
      if (strcmp(msg->html.transfer_encoding.c_str(), Content_Transfer_Encoding::enc_base64) == 0)
      {
        MB_String s1 = esp_mail_str_326;
        return sendBase64Stream(smtp, msg, msg->html.file.type, s1.c_str(), smtp->_sendCallback != NULL);
      }
    }

    int fileSize = mbfs->size(mbfs_type msg->html.file.type);

    if (fileSize > 0)
    {

      if (fileSize < chunkSize)
        chunkSize = fileSize;
      uint8_t *buf = (uint8_t *)newP(chunkSize);
      while (writeLen < fileSize && mbfs->available(mbfs_type msg->html.file.type))
      {
        if (writeLen > fileSize - chunkSize)
          chunkSize = fileSize - writeLen;
        int readLen = mbfs->read(mbfs_type msg->html.file.type, buf, chunkSize);

        if (readLen != chunkSize)
        {
          errorStatusCB(smtp, MB_FS_ERROR_FILE_IO_ERROR);
          break;
        }

        if (!bdat(smtp, msg, chunkSize, false))
        {
          ret = false;
          break;
        }

        if (smtpSend(smtp, buf, chunkSize) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
        {
          ret = false;
          break;
        }

        if (smtp->_sendCallback)
        {
          MB_String s1 = esp_mail_str_326;
          uploadReport(s1.c_str(), smtp->_lastProgress, 100 * writeLen / fileSize);
        }
        writeLen += chunkSize;
      }

      delP(&buf);

      if (smtp->_sendCallback)
      {
        MB_String s1 = esp_mail_str_326;
        uploadReport(s1.c_str(), smtp->_lastProgress, 100);
      }

      return ret && writeLen == fileSize;
    }
  }

