Vladimir-Trufanov/ittve-ESP32-CAM/99-Фото ловушка на ESP32 CAM/ESP-Mail-Client-master/src/ESP_Mail_Client.cpp
      if (!sendPartText(smtp, msg, esp_mail_msg_type_plain, alt.c_str()))
        return false;

      if (!sendPartText(smtp, msg, esp_mail_msg_type_html, alt.c_str()))
        return false;
    }
  }
  return true;
}

void ESP_Mail_Client::getInlineHeader(MB_String &header, const MB_String &boundary, SMTP_Attachment *inlineAttach, size_t size)
{
  header += esp_mail_str_33;
  header += boundary;
  header += esp_mail_str_34;

  header += esp_mail_str_25;
  header += esp_mail_str_131;

  if (inlineAttach->descr.mime.length() == 0)
  {
    MB_String mime;
    mimeFromFile(inlineAttach->descr.filename.c_str(), mime);
    if (mime.length() > 0)
      header += mime;
    else
      header += esp_mail_str_32;
  }
  else
    header += inlineAttach->descr.mime;

  header += esp_mail_str_26;

  MB_String filename = inlineAttach->descr.filename;

  size_t found = filename.find_last_of("/\\");

  if (found != MB_String::npos)
    filename = filename.substr(found + 1);

  header += filename;
  header += esp_mail_str_36;

  header += esp_mail_str_299;
  header += filename;
  header += esp_mail_str_327;
  header += size;
  header += esp_mail_str_34;

  header += esp_mail_str_300;
  header += filename;
  header += esp_mail_str_34;

  header += esp_mail_str_301;
  if (inlineAttach->descr.content_id.length() > 0)
    header += inlineAttach->descr.content_id;
  else
    header += inlineAttach->_int.cid;

  header += esp_mail_str_15;

  header += esp_mail_str_34;

  if (inlineAttach->descr.transfer_encoding.length() > 0)
  {
    header += esp_mail_str_272;
    header += inlineAttach->descr.transfer_encoding;
    header += esp_mail_str_34;
  }
  header += esp_mail_str_34;

  filename.clear();
}

void ESP_Mail_Client::getAttachHeader(MB_String &header, const MB_String &boundary, SMTP_Attachment *attach, size_t size)
{
  header += esp_mail_str_33;
  header += boundary;
  header += esp_mail_str_34;

  header += esp_mail_str_25;
  header += esp_mail_str_131;

  if (attach->descr.mime.length() == 0)
  {
    MB_String mime;
    mimeFromFile(attach->descr.filename.c_str(), mime);
    if (mime.length() > 0)
      header += mime;
    else
      header += esp_mail_str_32;
  }
  else
    header += attach->descr.mime;

  header += esp_mail_str_26;

  MB_String filename = attach->descr.filename;

  size_t found = filename.find_last_of("/\\");
  if (found != MB_String::npos)
    filename = filename.substr(found + 1);

  header += filename;
  header += esp_mail_str_36;

  if (!attach->_int.parallel)
  {
    header += esp_mail_str_30;
    header += filename;
    header += esp_mail_str_327;
    header += size;
    header += esp_mail_str_34;
  }

  if (attach->descr.transfer_encoding.length() > 0)
  {
    header += esp_mail_str_272;
    header += attach->descr.transfer_encoding;
    header += esp_mail_str_34;
  }

  header += esp_mail_str_34;
}

void ESP_Mail_Client::getRFC822PartHeader(SMTPSession *smtp, MB_String &header, const MB_String &boundary)
{
  header += esp_mail_str_33;
  header += boundary;
  header += esp_mail_str_34;

  header += esp_mail_str_25;
  header += esp_mail_str_131;

  header += esp_mail_str_123;
  header += esp_mail_str_34;

  header += esp_mail_str_98;

  header += esp_mail_str_34;
}

void ESP_Mail_Client::smtpCBP(SMTPSession *smtp, PGM_P info, bool success)
{
  MB_String s = info;
  smtpCB(smtp, s.c_str(), success);
}

void ESP_Mail_Client::smtpCB(SMTPSession *smtp, const char *info, bool success)
{
  smtp->_cbData._info = info;
  smtp->_cbData._success = success;
  smtp->_sendCallback(smtp->_cbData);
}

bool ESP_Mail_Client::sendBase64Raw(SMTPSession *smtp, SMTP_Message *msg, const uint8_t *data, size_t len, bool flashMem, const char *filename, bool report)
{
  bool ret = false;

  smtp->_lastProgress = -1;

  size_t chunkSize = (BASE64_CHUNKED_LEN * UPLOAD_CHUNKS_NUM) + (2 * UPLOAD_CHUNKS_NUM);
  size_t bufIndex = 0;
  size_t dataIndex = 0;

  if (len < chunkSize)
    chunkSize = len;

  uint8_t *buf = (uint8_t *)newP(chunkSize);
  memset(buf, 0, chunkSize);

  if (report)
    uploadReport(filename, smtp->_lastProgress, dataIndex);

  while (dataIndex < len - 1)
  {

    size_t size = 4;
    if (dataIndex + size > len - 1)
      size = len - dataIndex;

    if (flashMem)
      memcpy_P(buf + bufIndex, data + dataIndex, size);
    else
      memcpy(buf + bufIndex, data + dataIndex, size);

    dataIndex += size;
    bufIndex += size;

    if (bufIndex + 1 == BASE64_CHUNKED_LEN)
    {
      if (bufIndex + 2 < chunkSize)
      {
        buf[bufIndex++] = 0x0d;
        buf[bufIndex++] = 0x0a;
      }
    }

    if (bufIndex + 1 >= chunkSize - size)
    {
      if (!bdat(smtp, msg, bufIndex + 1, false))
        goto ex;

      if (smtpSend(smtp, buf, bufIndex + 1) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
        goto ex;

      bufIndex = 0;
    }

    if (report)
      uploadReport(filename, smtp->_lastProgress, 100 * dataIndex / len);
  }

  if (report)
    uploadReport(filename, smtp->_lastProgress, 100);

  ret = true;
ex:
  if (report)
    esp_mail_debug("");
  delP(&buf);
  return ret;
}

bool ESP_Mail_Client::sendBase64Stream(SMTPSession *smtp, SMTP_Message *msg, esp_mail_file_storage_type storageType, const char *filename, bool report)
{
  bool ret = false;

  smtp->_lastProgress = -1;

  int fileSize = mbfs->size(mbfs_type storageType);

  if (!fileSize)
  {
    errorStatusCB(smtp, MB_FS_ERROR_FILE_IO_ERROR);
    return false;
  }

  size_t chunkSize = (BASE64_CHUNKED_LEN * UPLOAD_CHUNKS_NUM) + (2 * UPLOAD_CHUNKS_NUM);
  size_t byteAdded = 0;
  size_t byteSent = 0;

  unsigned char *buf = (unsigned char *)newP(chunkSize);
  memset(buf, 0, chunkSize);

  size_t len = fileSize;
  size_t fbufIndex = 0;
  unsigned char *fbuf = (unsigned char *)newP(3);

  int dByte = 0;
  int bcnt = 0;

  if (report)
    uploadReport(filename, smtp->_lastProgress, bcnt);

  while (mbfs->available(mbfs_type storageType))
  {
    memset(fbuf, 0, 3);
    if (len - fbufIndex >= 3)
    {
      bcnt += 3;
      size_t readLen = mbfs->read(mbfs_type storageType, fbuf, 3);
      if (readLen != 3)
      {
        errorStatusCB(smtp, MB_FS_ERROR_FILE_IO_ERROR);
        break;
      }

      buf[byteAdded++] = b64_index_table[fbuf[0] >> 2];
      buf[byteAdded++] = b64_index_table[((fbuf[0] & 0x03) << 4) | (fbuf[1] >> 4)];
      buf[byteAdded++] = b64_index_table[((fbuf[1] & 0x0f) << 2) | (fbuf[2] >> 6)];
      buf[byteAdded++] = b64_index_table[fbuf[2] & 0x3f];
      dByte += 4;
      if (dByte == BASE64_CHUNKED_LEN)
      {
        if (byteAdded + 1 < chunkSize)
        {
          buf[byteAdded++] = 0x0d;
          buf[byteAdded++] = 0x0a;
        }
        dByte = 0;
      }
      if (byteAdded >= chunkSize - 4)
      {
        byteSent += byteAdded;

        if (!bdat(smtp, msg, byteAdded, false))
          goto ex;

        if (smtpSend(smtp, buf, byteAdded) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
          goto ex;

        memset(buf, 0, chunkSize);
        byteAdded = 0;
      }
      fbufIndex += 3;

      if (report)
        uploadReport(filename, smtp->_lastProgress, 100 * bcnt / len);
    }
    else
    {
      size_t readLen = mbfs->read(mbfs_type storageType, fbuf, len - fbufIndex);
      if (readLen != len - fbufIndex)
      {
        errorStatusCB(smtp, MB_FS_ERROR_FILE_IO_ERROR);
        break;
      }
    }
  }

  mbfs->close(mbfs_type storageType);
  if (byteAdded > 0)
  {
    if (!bdat(smtp, msg, byteAdded, false))
      goto ex;

    if (smtpSend(smtp, buf, byteAdded) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      goto ex;
  }

  if (len - fbufIndex > 0)
  {
    memset(buf, 0, chunkSize);
    byteAdded = 0;
    buf[byteAdded++] = b64_index_table[fbuf[0] >> 2];
    if (len - fbufIndex == 1)
    {
      buf[byteAdded++] = b64_index_table[(fbuf[0] & 0x03) << 4];
      buf[byteAdded++] = '=';
    }
    else
    {
      buf[byteAdded++] = b64_index_table[((fbuf[0] & 0x03) << 4) | (fbuf[1] >> 4)];
      buf[byteAdded++] = b64_index_table[(fbuf[1] & 0x0f) << 2];
    }
    buf[byteAdded++] = '=';

    if (!bdat(smtp, msg, byteAdded, false))
      goto ex;

    if (smtpSend(smtp, buf, byteAdded) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      goto ex;
  }
  ret = true;

  if (report)
    uploadReport(filename, smtp->_lastProgress, 100);

ex:
  delP(&buf);
  delP(&fbuf);
  mbfs->close(mbfs_type storageType);
  return ret;
}

bool ESP_Mail_Client::sendBase64StreamRaw(SMTPSession *smtp, SMTP_Message *msg, esp_mail_file_storage_type storageType, const char *filename, bool report)
{
  bool ret = false;

